//0:モーター, 1:ギヤ, 2:ボディ, 3:シャーシ, 4:フロント・ホイール, 5:リヤ・ホイール, 6:フロント・タイヤ, 7:リヤ・タイヤ, 8:フロントステー, 9:サイドステー, 10:リヤステー, 11:フロント中・ローラー, 12:サイド中・ローラー, 13:リヤ中・ローラー, 14:フロント上・ローラー, 15:サイド上・ローラー, 16:リヤ上・ローラー, 17:リヤ下・ローラー, 18:ウイング・ローラー, 19:ボディオプション, 20:フロント・スタビライザー, 21:サイド・スタビライザー, 22:リヤ・スタビライザー, 23:フロント・ウェイト, 24:リヤ・ウェイト, 25:アクセサリー・ターミナル, 26:アクセサリー・モーターサポート, 27:アクセサリー・ピニオンギヤ, 28:アクセサリー・プロペラシャフト, 29:アクセサリー・軸受け, 30:アクセサリー・シャフト, 31:アクセサリー・ギヤシャフト, 32:アクセサリー・クラウンギヤ, 33:バッテリー
var nameValue = new Array("moter", "gear", "body", "chassis", "f_wheel", "r_wheel", "f_tire", "r_tire", "f_stator", "s_stator", "r_stator", "fm_roller", "sm_roller", "rm_roller", "ft_roller", "st_roller", "rt_roller", "rb_roller", "w_roller", "bodyoption", "f_stabilizer", "s_stabilizer", "r_stabilizer", "f_weight", "r_weight", "terminal", "msupport", "pgear", "pshaft", "bearing", "shaft", "gshaft", "cgear", "battery");
var nameView = new Array("モーター ", "ギヤ ", "ボディ ", "シャーシ ", "フロント・ホイール ", "リヤ・ホイール ", "フロント・タイヤ ", "リヤ・タイヤ ", "フロントステー ", "サイドステー ", "リヤステー ", "フロント中・ローラー ", "サイド中・ローラー ", "リヤ中・ローラー ", "フロント上・ローラー ", "サイド上・ローラー ", "リヤ上・ローラー ", "リヤ下・ローラー ", "ウイング・ローラー ", "ボディオプション ", "フロント・スタビライザー ", "サイド・スタビライザー ", "リヤ・スタビライザー ", "フロント・ウェイト ", "リヤ・ウェイト ", "アクセサリー・ターミナル ", "アクセサリー・モーターサポート ", "アクセサリー・ピニオンギヤ ", "アクセサリー・プロペラシャフト ", "アクセサリー・軸受け ", "アクセサリー・シャフト ", "アクセサリー・ギヤシャフト ", "アクセサリー・クラウンギヤ ", "バッテリー ");
//0:モーター, 1:ギヤ, 2:ボディ, 3:シャーシ, 4:ホイール, 5:タイヤ, 6:フロントステー, 7:サイドステー, 8:リヤステー, 9:ローラー, 10:ボディオプション, 11:スタビライザー, 12:ウェイト, 13:ターミナル, 14:モーターサポート, 15:ピニオンギヤ, 16:プロペラシャフト, 17:軸受け, 18:シャフト, 19:ギヤシャフト, 20:クラウンギヤ, 21:バッテリー
var nameCalc = new Array(0, 1, 2, 3, 4, 4, 5, 5, 6, 7, 8, 9, 9, 9, 9, 9, 9, 9, 9, 10, 11, 11, 11, 12, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21);

var typeValue = new Array("", "speed", "power", "corner", "stamina", "weight", "gearfuka", "powerloss", "speedloss", "aerodf", "setsuden", "seishin", "thrust", "tiremasatsu", "tiresenkai", "tirehanpatsu", "tirekei", "rollermasatsu", "rollerteikou", "wave", "offload", "gearrate", "ampere", "brake", "stabilizer", "digital");
var typeView = new Array("", "スピード ", "パワー ", "コーナー安定 ", "スタミナ耐久 ", "重さ ", "ギヤ負荷 ", "パワーロス ", "スピードロス ", "ｴｱﾛﾀﾞｳﾝﾌｫｰｽ ", "節電 ", "制振 ", "スラスト角 ", "タイヤ摩擦 ", "タイヤ旋回 ", "タイヤ反発 ", "タイヤ径 ", "ローラー摩擦 ", "ローラー抵抗 ", "ウェーブ ", "オフロード ", "ギヤ比 ", "消費電流 ", "ブレーキ減速 ", "スタビ減速 ", "デジタル ");

var nameUpdate = new Array(1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
var nameZero = new Array(0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1);

var diagnosisValue = new Array("dia0speed_h", "dia1speed_s", "dia2battery", "dia3accele", "dia4arrivaltime", "dia5tiregrip", "dia6cornerdecele", "dia7jump", "dia8boundtime", "dia9gravity", "dia10rollerangle", "dia11weight", "dia12brake");
var diagnosisView = new Array("最高速度(時速)<font color='#FFA500'>※1</font> ", "最高速度(秒速)<font color='#FFA500'>※1</font> ", "バッテリー消費量 ", "加速度(毎秒)<font color='#FFA500'>※1</font> ", "最高速到達時間(秒) ", "タイヤグリップ ", "コーナー減速率 ", "ジャンプ飛距離<font color='#FFA500'>※2</font> ", "バウンド時間 ", "前後の重心<font color='#FFA500'>※3</font> ", "ローラースラスト角 ", "重さ ", "ブレーキ性能 ");

//タイプ 1:スピード, 2:パワー, 3:コーナー安定, 4:スタミナ耐久, 5:重さ, 6:ギヤ負荷, 7:パワーロス, 8:スピードロス, 9:エアロダウンフォース, 10:節電
//11:制振, 12:スラスト角, 13:タイヤ摩擦, 14:タイヤ旋回, 15:タイヤ反発, 16:タイヤ径, 17:ローラー摩擦, 18:ローラー抵抗, 19:ウェーブ, 20:オフロード
//21:ギヤ比, 22:消費電流, 23:ブレーキ減速, 24:スタビ減速, 25:デジタル
var s;
var typeSelect = new Array();
typeSelect[0] = new Array(1, 2, 3, 4, 5, 6, 22);
typeSelect[1] = new Array(1, 2, 3, 4, 5, 6, 7, 21);
typeSelect[2] = new Array(1, 2, 3, 4, 5, 9, 10);
typeSelect[3] = new Array(1, 2, 3, 4, 5, 6, 11, 12);
typeSelect[4] = new Array(1, 2, 3, 4, 5, 7, 8, 11, 19);
typeSelect[5] = new Array(1, 2, 3, 4, 5, 7, 8, 13, 14, 15, 16, 20);
typeSelect[6] = new Array(1, 2, 3, 4, 5, 9, 12, 25);
typeSelect[7] = new Array(1, 2, 3, 4, 5, 9);
typeSelect[8] = new Array(1, 2, 3, 4, 5, 9, 23);
typeSelect[9] = new Array(1, 2, 3, 4, 5, 17, 18);
typeSelect[10] = new Array(1, 2, 3, 4, 5, 9, 25);
typeSelect[11] = new Array(1, 2, 3, 4, 5, 24);
typeSelect[12] = new Array(1, 2, 3, 4, 5);
typeSelect[13] = new Array(1, 2, 3, 4, 5, 7, 10);
typeSelect[14] = new Array(1, 2, 3, 4, 5, 10);
typeSelect[15] = new Array(1, 2, 3, 4, 5, 6, 7);
typeSelect[16] = new Array(1, 2, 3, 4, 5, 6, 7);
typeSelect[17] = new Array(1, 2, 3, 4, 5, 8);
typeSelect[18] = new Array(1, 2, 3, 4, 5, 8);
typeSelect[19] = new Array(1, 2, 3, 4, 5, 6, 7);
typeSelect[20] = new Array(1, 2, 3, 4, 5, 6, 7);
typeSelect[21] = new Array(1, 2, 3, 4, 5);

var kaizouSelectIndex = new Array();
var kaizouSelect = new Array();
s = 0;
kaizouSelectIndex[0] = new Array(0, 0, 1, 2, 0);
kaizouSelect[0] = new Array();
kaizouSelect[0][s++] = new Array(0, 1, 4, 5, 6, 9);
kaizouSelect[0][s++] = new Array(0, 1, 2, 4, 5, 7, 10 ,11);
kaizouSelect[0][s++] = new Array(0, 1, 3, 4, 6, 8, 10 ,11);
s = 0;
kaizouSelectIndex[1] = new Array(0, 0);
kaizouSelect[1] = new Array();
kaizouSelect[1][s++] = new Array(0, 1, 2, 3, 4);
s = 0;
kaizouSelectIndex[2] = new Array(0, 0);
kaizouSelect[2] = new Array();
kaizouSelect[2][s++] = new Array(0, 1, 2, 3, 4);
s = 0;
kaizouSelectIndex[3] = new Array(0, 0);
kaizouSelect[3] = new Array();
kaizouSelect[3][s++] = new Array(0, 1, 2, 3, 4, 5, 6 ,7, 8);
s = 0;
kaizouSelectIndex[4] = new Array(0, 1, 2, 2, 0, 1, 2, 2, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1);
kaizouSelect[4] = new Array();
kaizouSelect[4][s++] = new Array(0, 2, 3, 4, 5, 6);
kaizouSelect[4][s++] = new Array(1, 2, 3, 4, 5, 6);
kaizouSelect[4][s++] = new Array(0, 2, 3, 4, 5, 6, 7);
s = 0;
kaizouSelectIndex[5] = new Array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0);
kaizouSelect[5] = new Array();
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 6);
s = 0;
kaizouSelectIndex[6] = new Array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0);
kaizouSelect[6] = new Array();
kaizouSelect[6][s++] = new Array(0, 1, 2, 3, 4, 6);
kaizouSelect[6][s++] = new Array(0, 1, 3, 4, 5, 6);
s = 0;
kaizouSelectIndex[7] = new Array(0, 0);
kaizouSelect[7] = new Array();
kaizouSelect[7][s++] = new Array(0, 1, 2, 3);
s = 0;
kaizouSelectIndex[8] = new Array(0, 1, 1, 0, 0, 0, 0);
kaizouSelect[8] = new Array();
kaizouSelect[8][s++] = new Array(0, 1, 2, 3);
kaizouSelect[8][s++] = new Array(0, 3);
s = 0;
kaizouSelectIndex[9] = new Array(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0);
kaizouSelect[9] = new Array();
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3);
s = 0;
kaizouSelectIndex[10] = new Array(0, 0, 0, 0, 1, 0, 0);
kaizouSelect[10] = new Array();
kaizouSelect[10][s++] = new Array(0, 1, 2);
kaizouSelect[10][s++] = new Array(0, 1, 2, 3);
s = 0;
kaizouSelectIndex[11] = new Array(0, 0);
kaizouSelect[11] = new Array();
kaizouSelect[11][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelectIndex[12] = new Array(0, 0);
kaizouSelect[12] = new Array();
kaizouSelect[12][s++] = new Array();
s = 0;
kaizouSelectIndex[13] = new Array(0, 0);
kaizouSelect[13] = new Array();
kaizouSelect[13][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelectIndex[14] = new Array(0, 0);
kaizouSelect[14] = new Array();
kaizouSelect[14][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelectIndex[15] = new Array(0, 0);
kaizouSelect[15] = new Array();
kaizouSelect[15][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelectIndex[16] = new Array(0, 0);
kaizouSelect[16] = new Array();
kaizouSelect[16][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelectIndex[17] = new Array(0, 0);
kaizouSelect[17] = new Array();
kaizouSelect[17][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelectIndex[18] = new Array(0, 0);
kaizouSelect[18] = new Array();
kaizouSelect[18][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelectIndex[19] = new Array(0, 0);
kaizouSelect[19] = new Array();
kaizouSelect[19][s++] = new Array(0, 1);
s = 0;
kaizouSelectIndex[20] = new Array(0, 0);
kaizouSelect[20] = new Array();
kaizouSelect[20][s++] = new Array();
s = 0;
kaizouSelectIndex[21] = new Array(0, 0);
kaizouSelect[21] = new Array();
kaizouSelect[21][s++] = new Array();

//1:適正(0:なし, 1:St, 2:U, 3:Kp, 4:Co, 5:J), 2:ボディオプション(0:なし, 1:スピードUP, 2:パワーUP, 3:コーナー安定UP, 4:コーナー速度UP, 5:スタミナ耐久UP, 6:ブレーキ効果UP, 7:バウンド抑制UP, 8:節電UP, 9:オフロード特効UP, 10:なし, 11:スピードUP+, 12:パワーUP+, 13:コーナー安定UP+, 14:コーナー速度UP+, 15:スタミナ耐久UP+, 16:ブレーキ効果UP+, 17:バウンド抑制UP+, 18:節電UP+, 19:オフロード特効UP+, 20:なし, 21:かっとびマシン)
var selectProper = new Array("－", "St", "U", "Kp", "Co", "J");
var selectOption = new Array("－", "スピードUP", "パワーUP", "コーナー安定UP", "コーナー速度UP", "スタミナ耐久UP", "ブレーキ効果UP", "バウンド抑制UP", "節電UP", "オフロード特効UP", "なし", "スピードUP+", "パワーUP+", "なし", "コーナー速度UP+", "なし", "なし", "バウンド抑制UP+", "節電UP+(仮)", "なし", "なし", "かっとびマシン");

var selectValue = new Array();
s = 0;
selectValue[0] = new Array();
selectValue[0][s++] = new Array("FA-130タイプノーマル", 0, 0, 1380.0, 495.0, 0.0, 0.0, 17.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1100.0);
selectValue[0][s++] = new Array("ハイパーミニ", 3, 0, 1460.0, 730.0, 0.0, 0.0, 17.0, 1500.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1000.0);
selectValue[0][s++] = new Array("トルクチューン", 2, 0, 1430.0, 1268.0, 0.0, 0.0, 17.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1700.0);
selectValue[0][s++] = new Array("レブチューン", 1, 0, 1740.0, 747.0, 0.0, 0.0, 17.0, 1500.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 2000.0);
selectValue[0][s++] = new Array("ハイパーダッシュ", 2, 0, 1900.0, 1583.0, 0.0, 0.0, 17.0, 1500.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1600.0);
s = 0;
selectValue[1] = new Array();
selectValue[1][s++] = new Array("5:1 標準ギヤ", 2, 0, 0.0, 20.0, 0.0, 0.2, 1.0, 1000.0, 400.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 5.0);
selectValue[1][s++] = new Array("4.2:1 高速ギヤ", 2, 0, 5.0, 15.0, 0.0, 0.2, 1.0, 1000.0, 400.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 4.2);
selectValue[1][s++] = new Array("4:1 ハイスピードギヤ", 1, 0, 10.0, 10.0, 0.0, 0.2, 1.0, 1000.0, 400.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 4.0);
selectValue[1][s++] = new Array("4:1 スーパーカウンターギヤ", 1, 0, 10.0, 10.0, 0.0, 0.4, 1.5, 900.0, 350.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 4.0);
selectValue[1][s++] = new Array("3.5:1 超速ギヤ", 1, 0, 20.0, 0.0, 0.0, 0.4, 1.5, 850.0, 350.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3.5);
s = 0;
selectValue[2] = new Array();
selectValue[2][s++] = new Array("パックマンボディ", 1, 2, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("スーパードラゴンSDP", 1, 1, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ホーネットJr.(棚橋SP)", 1, 1, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("アバンテJr.", 4, 4, 7.0, 4.0, 10.5, 5.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ウイニング・バード", 1, 1, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("グラスホッパーⅡJr.", 3, 5, 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("サンダーショットJr.", 2, 2, 7.0, 15.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("サンダードラゴンJr.", 3, 7, 1.0, 1.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("スーパーセイバーJr.", 1, 1, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("スーパードラゴンJr.", 1, 8, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("スコーチャーJr.", 3, 5, 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("セイントドラゴンJr.", 3, 6, 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ダッシュX1・原始皇帝", 4, 14, 7.0, 4.0, 10.5, 5.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ダッシュ0号 地平", 2, 8, 2.0, 18.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ダッシュ1号 皇帝", 2, 2, 5.0, 15.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ダッシュ2号 太陽", 3, 3, 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ダッシュ3号 流星", 1, 1, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ダッシュ4号 弾丸", 2, 2, 5.0, 15.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ダッシュ5号 D.D", 3, 9, 1.0, 1.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("バンキッシュJr.", 4, 4, 7.0, 4.0, 10.5, 5.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ビッグウィッグJr.", 3, 5, 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ファイヤードラゴンJr.", 4, 4, 7.0, 4.0, 10.5, 5.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ファルコンJr.", 3, 3, 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ブーメランJr.", 3, 6, 2.0, 2.0, 24.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("フォックスJr.", 4, 4, 7.0, 4.0, 10.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ホーネットJr.", 1, 1, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ホットショットJr.", 2, 1, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ライジング・バード", 2, 2, 2.0, 18.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("マグナムセイバー", 1, 1, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ソニックセイバー", 4, 4, 7.0, 4.0, 10.5, 5.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("スピンアックス", 4, 4, 7.0, 4.0, 10.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("トライダガーX", 1, 7, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ビークスパイダー", 4, 4, 7.0, 4.0, 10.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ブラックセイバー", 3, 5, 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("プロトセイバーJB", 3, 3, 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("シャイニングスコーピオン", 1, 11, 20.0, 0.0, 1.2, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ビクトリーマグナム", 1, 11, 20.0, 1.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("バンガードソニック", 4, 14, 7.0, 5.0, 10.5, 5.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("レイスティンガー", 3, 6, 9.0, 2.0, 18.0, 12.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ブーメラン・10", 1, 1, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("エアロソリチュード [FM]", 4, 4, 7.0, 4.0, 10.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("クリムゾングローリー [FM]", 1, 1, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ブロッケンギガント [FM]", 3, 5, 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("マグナムセイバー(そらまるSP)", 1, 2, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("マンタレイJr.", 1, 9, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("サイクロンマグナム", 1, 21, 20.0, 1.0, 4.05, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("クリムゾングローリー(銀メッキ) [FM]", 1, 1, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("トムゴディスペシャル", 4, 14, 8.0, 4.0, 10.0, 5.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("自由皇帝", 1, 12, 20.0, 1.0, 4.0, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ビッグウィッグJr.(コジ坊SP)", 3, 5, 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("スピンコブラ", 4, 14, 8.0, 4.0, 10.5, 5.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ネオトライダガーZMC", 1, 17, 20.0, 0.0, 18.0, 10.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ダッシュ01号 超皇帝", 2, 12, 6.0, 16.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("アバンテ2001Jr.", 1, 14, 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ダイナストームJr.", 3, 6, 2.0, 9.0, 18.0, 12.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("小覇龍", 1, 11, 18.0, 4.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("プロトセイバーエボリューション", 2, 12, 7.0, 7.0, 18.0, 12.0, 16.0, 0.0, 0.0, 0.0, 30.0, 0.0);
selectValue[2][s++] = new Array("ファイターマグナムVFX", 1, 8, 20.0, 0.0, 4.5, 0.0, 10.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("セイバー600 二郎丸スペシャル", 1, 9, 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);//59
s = 0;
var partsGravity = new Array(0, 0, 0, 0, 0.5, 0, 0.5, -0.5, 1.0, 0, -0.5, 1.0, 0, -1.0, 1.0, 0, -1.0, -1.0, -1.0, 0, 1.0, 0, -1.0, 0.5, -1.0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
var chassisGravity = new Array(0.025, 0.025, 0.025, 0.025, 0.025, 0.025, 0.025, -0.025, 0.025, 0.025);
var baseGravity = new Array(); //0:リヤローラーなしダブルアルミなし, 1:リヤローラーありダブルアルミなし, 2;リヤローラーなしダブルアルミあり, 3;リヤローラーありダブルアルミあり
baseGravity[0] = new Array( 65.0,  65.0,  65.0,  63.0,  63.0,  64.0,  63.0,  66.0,  72.0, 72.0);
baseGravity[1] = new Array(131.0, 131.0, 131.0, 127.0, 127.0, 128.0, 127.0, 132.0, 144.0, 144.0);
baseGravity[2] = new Array( 67.0,  67.0,  67.0,  65.0,  65.0,  65.0,  65.0,  67.0,  73.0, 73.0);
baseGravity[3] = new Array(134.0, 134.0, 134.0, 130.0, 130.0, 131.0, 130.0, 135.0, 147.0, 147.0);
selectValue[3] = new Array();
selectValue[3][s++] = new Array("スーパー1シャーシ", 4, 0, 10.0, 10.0, 9.12, 10.8, 15.8, 800.0, 0.0, 0.0, 0.0, 0.0, 100.0, 8.0);
selectValue[3][s++] = new Array("スーパー1強化シャーシ", 3, 0, 11.0, 10.0, 9.6, 25.0, 15.8, 800.0, 0.0, 0.0, 0.0, 0.0, 100.0, 8.0);
selectValue[3][s++] = new Array("ゼロシャーシ", 1, 0, 15.0, 5.0, 8.76, 13.5, 15.1, 850.0, 0.0, 0.0, 0.0, 0.0, 100.0, 5.0);
selectValue[3][s++] = new Array("タイプ1シャーシ", 2, 0, 2.0, 18.0, 8.4, 18.0, 18.8, 1000.0, 0.0, 0.0, 0.0, 0.0, 100.0, 1.0);
selectValue[3][s++] = new Array("タイプ1シャーシ(パックマン・棚橋SP)", 1, 0, 2.0, 18.0, 7.92, 18.0, 18.8, 1000.0, 0.0, 0.0, 0.0, 0.0, 100.0, 1.0);
selectValue[3][s++] = new Array("タイプ2シャーシ", 1, 0, 20.0, 0.0, 8.16, 14.4, 17.7, 950.0, 0.0, 0.0, 0.0, 0.0, 100.0, 1.0);
selectValue[3][s++] = new Array("タイプ3シャーシ", 1, 0, 4.0, 16.0, 7.68, 16.2, 18.6, 930.0, 0.0, 0.0, 0.0, 0.0, 100.0, 1.0);
selectValue[3][s++] = new Array("FMシャーシ", 2, 0, 9.0, 11.0, 8.52, 12.6, 18.0, 900.0, 0.0, 0.0, 0.0, 0.0, 100.0, 5.0);
selectValue[3][s++] = new Array("スーパーFMシャーシ", 4, 0, 12.0, 8.0, 9.12, 13.8, 17.8, 800.0, 0.0, 0.0, 0.0, 0.0, 100.0, 8.0);
selectValue[3][s++] = new Array("スーパーTZシャーシ", 1, 0, 12.0, 9.0, 9.12, 10.5, 15.7, 800.0, 0.0, 0.0, 0.0, 0.0, 100.0, 8.0);
s = 0;
selectValue[4] = new Array();
selectValue[4][s++] = new Array("小径タイプ1・フロント", 2, 0, 0.0, 12.0, 1.0, 2.0, 1.7, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径タイプ1・リヤ", 2, 0, 0.0, 12.0, 1.0, 2.0, 2.3, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径ナローワンウェイ(通常・赤)・フロント", 3, 0, 8.0, 5.0, 4.0, 2.6, 3.0, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[4][s++] = new Array("小径ナローワンウェイ(通常・赤)・リヤ", 3, 0, 8.0, 5.0, 4.0, 2.6, 4.5, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[4][s++] = new Array("小径ローハイトワイド・フロント", 2, 0, 5.0, 8.0, 2.0, 2.8, 1.7, 0.0, 160.0, 1000.0, 0.0, 0.0, 100.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径ローハイトワイド・リヤ", 2, 0, 5.0, 8.0, 2.0, 2.8, 2.3, 0.0, 160.0, 1000.0, 0.0, 0.0, 100.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径ローハイトWワンウェイ(通常・紫)・フロント", 3, 0, 6.0, 7.0, 6.0, 3.0, 3.0, 0.0, 80.0, 1000.0, 0.0, 0.0, 100.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[4][s++] = new Array("小径ローハイトWワンウェイ(通常・紫)・リヤ", 3, 0, 6.0, 7.0, 6.0, 3.0, 4.5, 0.0, 80.0, 1000.0, 0.0, 0.0, 100.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[4][s++] = new Array("大径タイプ1・フロント", 1, 0, 12.0, 0.0, 1.0, 2.0, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ1・リヤ", 1, 0, 12.0, 0.0, 1.0, 2.0, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ1(パックマン)・フロント", 1, 0, 12.0, 2.0, 1.0, 2.0, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ1(パックマン)・リヤ", 1, 0, 12.0, 2.0, 1.0, 2.0, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ2・フロント", 1, 0, 12.0, 0.0, 1.0, 2.4, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ2・リヤ", 1, 0, 12.0, 0.0, 1.0, 2.4, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ3・フロント", 1, 0, 12.0, 0.0, 1.0, 2.6, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ3・リヤ", 1, 0, 12.0, 0.0, 1.0, 2.6, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ4・フロント", 1, 0, 12.0, 0.0, 1.0, 2.0, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ4・リヤ", 1, 0, 12.0, 0.0, 1.0, 2.0, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ7(棚橋SP)・フロント", 1, 0, 11.0, 3.0, 1.0, 2.0, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ7(棚橋SP)・リヤ", 1, 0, 11.0, 3.0, 1.0, 2.0, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径エアロホイール・フロント", 1, 0, 12.0, 1.0, 1.0, 2.4, 1.7, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径エアロホイール・リヤ", 1, 0, 12.0, 1.0, 1.0, 2.4, 2.3, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径スピード・フロント", 1, 0, 13.0, 0.0, 1.0, 2.4, 1.6, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径スピード・リヤ", 1, 0, 13.0, 0.0, 1.0, 2.4, 2.2, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径ライトウェイト・フロント", 1, 0, 11.0, 2.0, 1.0, 2.0, 1.5, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径ライトウェイト・リヤ", 1, 0, 11.0, 2.0, 1.0, 2.0, 2.0, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径ワイド・フロント", 1, 0, 11.0, 2.0, 2.0, 2.9, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径ワイド・リヤ", 1, 0, 11.0, 2.0, 2.0, 2.9, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径ワンウェイ(通常・青)・フロント", 3, 0, 10.0, 3.0, 4.0, 2.6, 3.0, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[4][s++] = new Array("大径ワンウェイ(通常・青)・リヤ", 3, 0, 10.0, 3.0, 4.0, 2.6, 4.5, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[4][s++] = new Array("小径タイプ2・フロント", 2, 0, 1.0, 12.0, 1.0, 2.0, 1.7, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径タイプ2・リヤ", 2, 0, 1.0, 12.0, 1.0, 2.0, 2.3, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径リアルコブラ・フロント", 2, 0, 0.0, 12.0, 1.0, 2.0, 1.7, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径リアルコブラ・リヤ", 2, 0, 0.0, 12.0, 1.0, 2.0, 2.3, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径ZMC(赤)・フロント", 2, 0, 2.0, 12.0, 1.0, 2.7, 2.8, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径リアルEVO(銀)・フロント", 2, 0, 0.0, 12.0, 1.0, 2.0, 1.7, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径リアルEVO(銀)・リヤ", 2, 0, 0.0, 12.0, 1.0, 2.0, 2.3, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
s = 0;
selectValue[5] = new Array();
selectValue[5][s++] = new Array("小径ノーマル・フロント", 2, 0, 0.0, 10.0, 1.8, 2.4, 5.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 90.0, 26.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径ノーマル・リヤ", 2, 0, 0.0, 10.0, 1.8, 2.4, 7.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 90.0, 26.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径スリック・フロント", 2, 0, 2.0, 10.0, 2.0, 2.2, 5.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 85.0, 26.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径スリック・リヤ", 2, 0, 2.0, 10.0, 2.0, 2.2, 7.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 85.0, 26.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径スリック(赤)・フロント", 2, 0, 2.0, 10.0, 2.0, 2.4, 5.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 85.0, 26.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径スリック(赤)・リヤ", 2, 0, 2.0, 10.0, 2.0, 2.4, 7.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 85.0, 26.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径スポンジ・フロント", 2, 0, 2.0, 11.0, 3.6, 2.0, 3.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 76.0, 73.0, 65.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径スポンジ・リヤ", 2, 0, 2.0, 11.0, 3.6, 2.0, 4.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 76.0, 73.0, 65.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径レストンスポンジ(青・橙)・フロント", 2, 0, 3.0, 10.0, 4.8, 2.0, 2.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 80.0, 78.0, 60.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径レストンスポンジ(青・橙)・リヤ", 2, 0, 3.0, 10.0, 4.8, 2.0, 3.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 80.0, 78.0, 60.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径ローハイトWスリック(通常・赤)・フロント", 3, 0, 4.5, 8.5, 10.0, 4.0, 3.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 76.0, 80.0, 90.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径ローハイトWスリック(通常・赤)・リヤ", 3, 0, 4.5, 8.5, 10.0, 4.0, 4.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 76.0, 80.0, 90.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径ローハイトWスポンジ・フロント", 3, 0, 8.0, 5.0, 10.0, 4.0, 4.5, 0.0, 135.0, 945.0, 0.0, 0.0, 0.0, 0.0, 80.0, 84.0, 100.0, 27.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径ローハイトWスポンジ・リヤ", 3, 0, 8.0, 5.0, 10.0, 4.0, 5.5, 0.0, 135.0, 945.0, 0.0, 0.0, 0.0, 0.0, 80.0, 84.0, 100.0, 27.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径ローハイトWスポンジ(灰)・フロント", 3, 0, 4.5, 8.5, 10.0, 4.0, 3.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 80.0, 84.0, 80.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径ローハイトWスポンジ(灰)・リヤ", 3, 0, 4.5, 8.5, 10.0, 4.0, 4.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 80.0, 84.0, 80.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径ローハイトW薄スポンジ・フロント", 3, 0, 6.0, 7.0, 10.0, 4.0, 4.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 80.0, 84.0, 80.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径ローハイトW薄スポンジ・リヤ", 3, 0, 6.0, 7.0, 10.0, 4.0, 5.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 80.0, 84.0, 80.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径ノーマル・フロント", 1, 0, 10.0, 0.0, 1.8, 2.4, 5.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 130.0, 31.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径ノーマル・リヤ", 1, 0, 10.0, 0.0, 1.8, 2.4, 7.8, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 130.0, 31.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スリック・フロント", 1, 0, 12.0, 0.0, 2.0, 2.2, 5.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 130.0, 31.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スリック・リヤ", 1, 0, 12.0, 0.0, 2.0, 2.2, 7.8, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 130.0, 31.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スリック(赤)・フロント", 1, 0, 12.0, 0.0, 2.0, 2.4, 5.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 130.0, 31.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スリック(赤)・リヤ", 1, 0, 12.0, 0.0, 2.0, 2.4, 7.8, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 130.0, 31.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スポンジ(通常・青・緑)・フロント", 2, 0, 12.0, 1.0, 3.6, 2.0, 3.5, 0.0, 150.0, 1050.0, 0.0, 0.0, 0.0, 0.0, 76.0, 73.0, 120.0, 30.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スポンジ(通常・青・緑)・リヤ", 2, 0, 12.0, 1.0, 3.6, 2.0, 4.5, 0.0, 150.0, 1050.0, 0.0, 0.0, 0.0, 0.0, 76.0, 73.0, 120.0, 30.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径ワイドスポンジ(黒)・フロント", 1, 0, 11.0, 2.0, 10.0, 4.0, 4.5, 0.0, 150.0, 1050.0, 0.0, 0.0, 0.0, 0.0, 80.0, 84.0, 110.0, 30.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径ワイドスポンジ(黒)・リヤ", 1, 0, 11.0, 2.0, 10.0, 4.0, 5.5, 0.0, 150.0, 1050.0, 0.0, 0.0, 0.0, 0.0, 80.0, 84.0, 110.0, 30.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スパイク・フロント", 1, 0, 12.0, 0.0, 1.8, 2.8, 5.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 56.0, 67.0, 138.0, 31.0, 0.0, 0.0, 0.0, 2000.0);
selectValue[5][s++] = new Array("大径スパイク・リヤ", 1, 0, 12.0, 0.0, 1.8, 2.8, 7.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 56.0, 67.0, 138.0, 31.0, 0.0, 0.0, 0.0, 2000.0);
selectValue[5][s++] = new Array("大径スパイク(赤)・フロント", 1, 0, 12.0, 0.0, 1.8, 2.8, 5.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 76.0, 67.0, 138.0, 31.0, 0.0, 0.0, 0.0, 2000.0);
selectValue[5][s++] = new Array("大径スパイク(赤)・リヤ", 1, 0, 12.0, 0.0, 1.8, 2.8, 7.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 76.0, 67.0, 138.0, 31.0, 0.0, 0.0, 0.0, 2000.0);
selectValue[5][s++] = new Array("小径トレッドパターン・フロント", 2, 0, 4.0, 9.0, 1.8, 2.8, 5.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 56.0, 67.0, 98.0, 26.0, 0.0, 0.0, 0.0, 2000.0);
selectValue[5][s++] = new Array("小径トレッドパターン・リヤ", 2, 0, 4.0, 9.0, 1.8, 2.8, 7.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 56.0, 67.0, 98.0, 26.0, 0.0, 0.0, 0.0, 2000.0);
s = 0;
selectValue[6] = new Array();
selectValue[6][s++] = new Array("なし", 0, 0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[6][s++] = new Array("エアロハイマウント フロントステー", 3, 0, 0.0, 0.0, 26.4, 30.0, 4.0, 0.0, 0.0, 0.0, 30.0, 0.0, 0.0, 3.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[6][s++] = new Array("ハイマウント フロントステー(通常・紫)", 4, 0, 0.0, 0.0, 26.4, 30.5, 4.0, 0.0, 0.0, 0.0, 20.0, 0.0, 0.0, 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[6][s++] = new Array("フロント強化ガード", 3, 0, 0.0, 0.0, 28.8, 32.5, 3.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[6][s++] = new Array("ターボフロントステー(通常・赤)", 3, 0, 0.0, 0.0, 24.0, 25.0, 3.0, 0.0, 0.0, 0.0, 10.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[6][s++] = new Array("FRP補強プレート・フロント", 3, 0, 0.0, 0.0, 36.0, 49.0, 4.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[6][s++] = new Array("FRP強化マウント・フロント", 3, 0, 0.0, 0.0, 38.4, 55.0, 4.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 2.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[6][s++] = new Array("スペーサー付き補強FRP・フロント", 3, 0, 0.0, 0.0, 36.0, 45.0, 6.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[6][s++] = new Array("ダウンスラストフロントステー", 3, 0, 0.0, 0.0, 32.4, 40.5, 5.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[6][s++] = new Array("可変ダウンスラストローラーステー", 3, 0, 0.0, 0.0, 31.2, 39.0, 6.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 5.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[6][s++] = new Array("フロントスライドダンパー(通常・赤)", 3, 0, 0.0, 0.0, 33.6, 42.0, 5.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 3.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[6][s++] = new Array("(-)FRP強化マウント・フロント", 3, 0, 0.0, 0.0, 38.4, 55.0, 4.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, -4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[6][s++] = new Array("スペーサー付(-)FRP強化マウント・F", 3, 0, 0.0, 0.0, 38.4, 55.0, 4.3, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, -4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
s = 0;
selectValue[7] = new Array();
selectValue[7][s++] = new Array("なし", 0, 0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[7][s++] = new Array("サイドガード", 3, 0, 0.0, 0.0, 12.0, 5.0, 2.0, 0.0, 0.0, 0.0, 1.0);
selectValue[7][s++] = new Array("ポール付きFRPショート・サイド", 3, 0, 0.0, 0.0, 38.4, 27.5, 6.0, 0.0, 0.0, 0.0, 1.0);
selectValue[7][s++] = new Array("サイドポール", 3, 0, 0.0, 0.0, 12.0, 15.0, 6.0, 0.0, 0.0, 0.0, 1.0);
s = 0;
selectValue[8] = new Array();
selectValue[8][s++] = new Array("なし", 0, 0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[8][s++] = new Array("アルミリヤーマルチステー", 3, 0, 0.0, 0.0, 36.0, 50.0, 6.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[8][s++] = new Array("ダブルアルミリヤステー(通常・青)", 3, 0, 0.0, 0.0, 39.6, 60.0, 6.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[8][s++] = new Array("リヤースキッド", 5, 0, 0.0, 0.0, 31.8, 34.5, 4.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 40.0);
selectValue[8][s++] = new Array("リヤローラー・スタビステー", 5, 0, 0.0, 0.0, 31.2, 27.5, 6.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 50.0);
selectValue[8][s++] = new Array("リヤブレーキステー(ハード)", 5, 0, 0.0, 0.0, 30.0, 30.0, 4.8, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 100.0);
selectValue[8][s++] = new Array("リヤブレーキステー(ソフト)", 5, 0, 0.0, 0.0, 30.0, 30.0, 4.8, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 200.0);
s = 0;
selectValue[9] = new Array();
selectValue[9][s++] = new Array("なし", 0, 0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[9][s++] = new Array("ローラー用9mmボールベアリング", 4, 0, 0.0, 0.0, 68.4, 16.25, 2.9, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 15.0, 100.0);
selectValue[9][s++] = new Array("10mm標準プラ1(灰・赤)", 1, 0, 0.0, 0.0, 24.0, 2.5, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 300.0);
selectValue[9][s++] = new Array("10mm標準プラ1(黒)", 2, 0, 0.0, 0.0, 24.0, 2.5, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 300.0);
selectValue[9][s++] = new Array("10mm標準プラ1(パックマン)", 1, 0, 0.0, 0.0, 36.0, 2.5, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 300.0);
selectValue[9][s++] = new Array("10mm標準プラ2", 1, 0, 0.0, 0.0, 24.0, 2.5, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 300.0);
selectValue[9][s++] = new Array("12mm標準プラ1", 4, 0, 0.0, 0.0, 36.0, 2.5, 1.2, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 300.0);
selectValue[9][s++] = new Array("12mmセットアップローラーズ", 1, 0, 0.0, 0.0, 37.5, 3.0, 1.2, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 250.0);
selectValue[9][s++] = new Array("12mmゴム付きプラ", 3, 0, 0.0, 0.0, 79.2, 3.0, 1.3, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 300.0);
selectValue[9][s++] = new Array("13mmセットアップローラーズ", 1, 0, 0.0, 0.0, 40.5, 3.0, 1.3, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 250.0);
selectValue[9][s++] = new Array("ローラー用13mmボールベアリング", 4, 0, 0.0, 0.0, 82.8, 16.25, 3.3, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 15.0, 100.0);
selectValue[9][s++] = new Array("14mmセットアップローラーズ", 4, 0, 0.0, 0.0, 46.8, 3.0, 1.4, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 250.0);
selectValue[9][s++] = new Array("14mm標準プラ1", 4, 0, 0.0, 0.0, 43.2, 2.5, 1.4, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 300.0);
selectValue[9][s++] = new Array("14mmプラベアリング(通常・赤)", 4, 0, 0.0, 0.0, 50.4, 2.5, 1.4, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 150.0);
selectValue[9][s++] = new Array("14mm標準ゴム1", 3, 0, 0.0, 0.0, 86.4, 3.5, 1.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 300.0);
selectValue[9][s++] = new Array("14mm標準ゴム2", 3, 0, 0.0, 0.0, 86.4, 3.5, 1.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 300.0);
selectValue[9][s++] = new Array("14mmゴム付きプラベアリング(通常・青)", 3, 0, 0.0, 0.0, 86.4, 3.0, 1.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 150.0);
selectValue[9][s++] = new Array("15mmセットアップローラーズ", 4, 0, 0.0, 0.0, 50.4, 3.0, 1.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 250.0);
selectValue[9][s++] = new Array("15mmゴム付きプラ", 3, 0, 0.0, 0.0, 90.0, 3.5, 1.6, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 300.0);
selectValue[9][s++] = new Array("16mm標準プラ1", 4, 0, 0.0, 0.0, 50.4, 2.5, 1.6, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 300.0);
selectValue[9][s++] = new Array("16mm標準プラ2(白・棚橋SP)", 1, 0, 0.0, 0.0, 50.4, 2.5, 1.6, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 300.0);
selectValue[9][s++] = new Array("16mmセットアップローラーズ", 4, 0, 0.0, 0.0, 54.0, 3.0, 1.6, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 250.0);
selectValue[9][s++] = new Array("16mmゴム付きプラ", 3, 0, 0.0, 0.0, 93.6, 3.5, 1.7, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 300.0);
selectValue[9][s++] = new Array("19mmゴム付きプラ", 3, 0, 0.0, 0.0, 104.4, 3.0, 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 300.0);
selectValue[9][s++] = new Array("19mmゴム付きアルミベアリング", 3, 0, 0.0, 0.0, 104.4, 12.5, 4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 100.0);
selectValue[9][s++] = new Array("19mmゴム大径アルミベアリング(青・赤)", 3, 0, 0.0, 0.0, 104.4, 12.5, 4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 100.0);
selectValue[9][s++] = new Array("16mm低摩擦プラ(橙)", 4, 0, 0.0, 0.0, 50.4, 2.5, 0.7, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 6.0, 125.0);
selectValue[9][s++] = new Array("19mm低摩擦プラ(紫)", 4, 0, 0.0, 0.0, 59.4, 2.5, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 6.0, 125.0);
s = 0;
selectValue[10] = new Array();
selectValue[10][s++] = new Array("なし", 0, 0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[10][s++] = new Array("ターボリヤウイング(通常・赤)", 3, 0, 0.0, 0.0, 300.0, 1.2, 2.0, 0.0, 0.0, 0.0, 150.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[10][s++] = new Array("エアロハイマウント リヤウイング", 3, 0, 0.0, 0.0, 280.0, 3.6, 4.0, 0.0, 0.0, 0.0, 100.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[10][s++] = new Array("ハイマウント リヤウイング(通常・紫)", 4, 0, 0.0, 0.0, 240.0, 2.4, 3.0, 0.0, 0.0, 0.0, 80.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[10][s++] = new Array("スライドダンパー(通常・赤)", 3, 0, 0.0, 0.0, 200.0, 4.8, 5.0, 0.0, 0.0, 0.0, 60.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[10][s++] = new Array("可変リヤーウイング・ナロー", 3, 0, 0.0, 0.0, 260.0, 2.4, 4.0, 0.0, 0.0, 0.0, 150.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[10][s++] = new Array("可変リヤーウイング・ワイド", 3, 0, 0.0, 0.0, 300.0, 3.6, 5.0, 0.0, 0.0, 0.0, 180.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
s = 0;
selectValue[11] = new Array();
selectValue[11][s++] = new Array("なし", 0, 0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[11][s++] = new Array("スタビライザーポール", 3, 0, 0.0, 0.0, 45.0, 2.5, 3.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 10.0);
selectValue[11][s++] = new Array("11mm大径スタビヘッド", 3, 0, 0.0, 0.0, 48.0, 2.5, 3.7, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 15.0);
selectValue[11][s++] = new Array("15mm大径スタビヘッド", 3, 0, 0.0, 0.0, 49.5, 2.5, 4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0);
s = 0;
selectValue[12] = new Array();
selectValue[12][s++] = new Array("なし", 0, 0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[12][s++] = new Array("セッティングウェイト2g", 5, 0, 0.0, 0.0, 0.0, 0.0, 2.0);
selectValue[12][s++] = new Array("セッティングウェイト4g", 5, 0, 0.0, 0.0, 0.0, 0.0, 4.0);
selectValue[12][s++] = new Array("セッティングウェイト6g", 5, 0, 0.0, 0.0, 0.0, 0.0, 6.0);
selectValue[12][s++] = new Array("セッティングウェイト8g", 5, 0, 0.0, 0.0, 0.0, 0.0, 8.0);
s = 0;
selectValue[13] = new Array();
selectValue[13][s++] = new Array("標準ターミナル", 0, 0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[13][s++] = new Array("ゴールドターミナル", 1, 0, 28.0, 2.0, 0.0, 1.0, 1.0, 0.0, 48.0, 0.0, 0.0, 1200.0);
s = 0;
selectValue[14] = new Array();
selectValue[14][s++] = new Array("なし", 0, 0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[14][s++] = new Array("放熱フィン", 1, 0, 7.0, 23.0, 0.0, 1.0, 1.5, 0.0, 0.0, 0.0, 0.0, 1000.0);
selectValue[14][s++] = new Array("アルミモーターサポート", 1, 0, 5.0, 25.0, 0.0, 4.0, 1.5, 0.0, 0.0, 0.0, 0.0, 600.0);
s = 0;
selectValue[15] = new Array();
selectValue[15][s++] = new Array("標準ピニオンギヤ", 0, 0, 0.0, 0.0, 0.0, 0.0, 0.1, 700.0, 400.0);
selectValue[15][s++] = new Array("ピニオンギヤ(紫)", 2, 0, 10.0, 10.0, 0.0, 0.2, 0.1, 650.0, 380.0);
selectValue[15][s++] = new Array("真ちゅうピニオンギヤ", 3, 0, 4.0, 16.0, 0.0, 1.0, 0.3, 650.0, 380.0);
s = 0;
selectValue[16] = new Array();
selectValue[16][s++] = new Array("標準プロペラシャフト", 0, 0, 0.0, 0.0, 0.0, 0.0, 2.0, 700.0, 300.0);
selectValue[16][s++] = new Array("中空軽量プロペラシャフト", 2, 0, 16.0, 14.0, 0.0, 0.2, 1.0, 650.0, 280.0);
s = 0;
selectValue[17] = new Array();
selectValue[17][s++] = new Array("標準軸受け", 0, 0, 0.0, 0.0, 0.0, 0.0, 2.0, 0.0, 0.0, 1200.0);
selectValue[17][s++] = new Array("メタル軸受け", 3, 0, 8.0, 22.0, 0.0, 1.0, 4.0, 0.0, 0.0, 950.0);
selectValue[17][s++] = new Array("ボールベアリング", 3, 0, 17.0, 13.0, 0.0, 2.0, 3.0, 0.0, 0.0, 900.0);
selectValue[17][s++] = new Array("丸穴ボールベアリング", 1, 0, 30.0, 0.0, 0.0, 2.0, 3.0, 0.0, 0.0, 850.0);
s = 0;
selectValue[18] = new Array();
selectValue[18][s++] = new Array("標準シャフト", 0, 0, 0.0, 0.0, 0.0, 0.0, 2.5, 0.0, 0.0, 1200.0);
selectValue[18][s++] = new Array("ハードシャフト", 3, 0, 5.0, 25.0, 0.0, 2.0, 3.0, 0.0, 0.0, 950.0);
selectValue[18][s++] = new Array("中空ステンレスシャフト", 3, 0, 25.0, 5.0, 0.0, 1.0, 2.0, 0.0, 0.0, 900.0);
s = 0;
selectValue[19] = new Array();
selectValue[19][s++] = new Array("標準ギヤシャフト", 0, 0, 0.0, 0.0, 0.0, 0.0, 0.3, 700.0, 300.0);
selectValue[19][s++] = new Array("フッソコートギヤシャフト", 1, 0, 15.0, 15.0, 0.0, 0.2, 0.3, 650.0, 280.0);
s = 0;
selectValue[20] = new Array();
selectValue[20][s++] = new Array("標準クラウンギヤ", 0, 0, 0.0, 0.0, 0.0, 0.0, 0.5, 700.0, 300.0);
s = 0;
selectValue[21] = new Array();
selectValue[21][s++] = new Array("標準バッテリー", 0, 0, 0.0, 0.0, 0.0, 0.0, 36.0);
selectValue[21][s++] = new Array("パワーチャンプゴールド", 0, 0, 0.0, 0.0, 0.0, 0.0, 36.0);

//2:イイ感じ, 3:職人技, 4:至高の逸品, 5:強化, 6:固定フラグ, 7:タイプ
var kaizouValue = new Array();
kaizouValue[0] = new Array();
kaizouValue[0][0] = new Array();
kaizouValue[0][0][0] = new Array("慣らし走行 [1]", "ギヤ負荷〇〇〇〇 [8] ", -0.08, -0.096, -0.112, -0.004, -1, 6);
kaizouValue[0][0][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[0][1] = new Array();
kaizouValue[0][1][0] = new Array("ピニオンギヤの固定", "ギヤ負荷〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 6);
kaizouValue[0][1][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[0][2] = new Array();
kaizouValue[0][2][0] = new Array("ブレークイン(トルク重視) ", "パワー〇〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 2);
kaizouValue[0][3] = new Array();
kaizouValue[0][3][0] = new Array("ブレークイン(回転数重視) ", "スピード〇〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 1);
kaizouValue[0][4] = new Array();
kaizouValue[0][4][0] = new Array("ブレークイン(バランス重視)", "スピード〇 [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 1);
kaizouValue[0][4][1] = new Array("", "パワー〇 [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 2);
kaizouValue[0][5] = new Array();
kaizouValue[0][5][0] = new Array("3Vブレークイン(トルク重視) [4]", "パワー〇〇〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 2);
kaizouValue[0][6] = new Array();
kaizouValue[0][6][0] = new Array("3Vブレークイン(回転数重視) [4]", "スピード〇〇〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 1);
kaizouValue[0][7] = new Array();
kaizouValue[0][7][0] = new Array("3Vブレークイン(バランス重視[トルク]) [2]", "スピード〇 [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 1);
kaizouValue[0][7][1] = new Array("", "パワー〇〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 2);
kaizouValue[0][8] = new Array();
kaizouValue[0][8][0] = new Array("3Vブレークイン(バランス重視[レブ]) [2]", "スピード〇〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 1);
kaizouValue[0][8][1] = new Array("", "パワー〇 [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 2);
kaizouValue[0][9] = new Array();
kaizouValue[0][9][0] = new Array("冷却ブレークイン(バランス重視) [2]", "スピード〇〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 1);
kaizouValue[0][9][1] = new Array("", "パワー〇〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 2);
kaizouValue[0][10] = new Array();
kaizouValue[0][10][0] = new Array("冷却ブレークイン(トルク重視) [2]", "パワー〇〇〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 2);
kaizouValue[0][11] = new Array();
kaizouValue[0][11][0] = new Array("冷却ブレークイン(回転数重視) [2]", "スピード〇〇〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 1);

kaizouValue[1] = new Array();
kaizouValue[1][0] = new Array();
kaizouValue[1][0][0] = new Array("ギヤメンテ", "ギヤ負荷〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 6);
kaizouValue[1][0][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[1][1] = new Array();
kaizouValue[1][1][0] = new Array("ギヤ慣らし", "パワーロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 7);
kaizouValue[1][1][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[1][2] = new Array();
kaizouValue[1][2][0] = new Array("ギヤ研磨 [4]", "ギヤ負荷〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 6);
kaizouValue[1][2][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[1][3] = new Array();
kaizouValue[1][3][0] = new Array("ギヤフローティング加工 [2]", "ギヤ負荷〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 6);
kaizouValue[1][3][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[1][4] = new Array();
kaizouValue[1][4][0] = new Array("ギヤ位置の固定 [2]", "パワーロス〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 7);
kaizouValue[1][4][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);

kaizouValue[2] = new Array();
kaizouValue[2][0] = new Array();
kaizouValue[2][0][0] = new Array("軽量化", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[2][0][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[2][1] = new Array();
kaizouValue[2][1][0] = new Array("ｴｱﾛﾀﾞｳﾝﾌｫｰｽ増加 [4]", "ｴｱﾛﾀﾞｳﾝﾌｫｰｽ〇 [5] ", 0.05, 0.06, 0.07, 0.0025, -1, 9);
kaizouValue[2][1][1] = new Array("", "コーナー安定〇 [50(全固定)] ", 1.0, 1.2, 1.4, 0.025, -2, 3);
kaizouValue[2][2] = new Array();
kaizouValue[2][2][0] = new Array("ｴｱﾛﾀﾞｳﾝﾌｫｰｽ減少 [4]", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[2][2][1] = new Array("", "ｴｱﾛﾀﾞｳﾝﾌｫｰｽ× [5] ", -0.05, -0.06, -0.07, -0.0025, -1, 9);
kaizouValue[2][3] = new Array();
kaizouValue[2][3][0] = new Array("冷却能力向上 [4]", "節電〇 [10000(全固定)] ", 50, 60, 70, 5.0, -2, 10);
kaizouValue[2][3][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[2][4] = new Array();
kaizouValue[2][4][0] = new Array("限界軽量化 [2]", "重さ〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 5);
kaizouValue[2][4][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[2][4][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);

kaizouValue[3] = new Array();
kaizouValue[3][0] = new Array();
kaizouValue[3][0][0] = new Array("グリスアップ", "ギヤ負荷〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 6);
kaizouValue[3][0][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[3][1] = new Array();
kaizouValue[3][1][0] = new Array("軽量化", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[3][1][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[3][2] = new Array();
kaizouValue[3][2][0] = new Array("限界軽量化 [2]", "重さ〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 5);
kaizouValue[3][2][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[3][2][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);
kaizouValue[3][3] = new Array();
kaizouValue[3][3][0] = new Array("電池落とし", "コーナー安定〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 3);
kaizouValue[3][4] = new Array();
kaizouValue[3][4][0] = new Array("剛性補強 [4]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[3][4][1] = new Array("", "重さ× [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 5);
kaizouValue[3][5] = new Array();
kaizouValue[3][5][0] = new Array("ギヤ位置の調整 [2]", "ギヤ負荷〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 6);
kaizouValue[3][5][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[3][6] = new Array();
kaizouValue[3][6][0] = new Array("制振対策 [4]", "制振〇 [45] ", 0.45, 0.54, 0.63, 0.0225, -1, 11);
kaizouValue[3][6][1] = new Array("", "コーナー安定〇 [50(全固定)] ", 1.0, 1.2, 1.4, 0.025, -2, 3);
kaizouValue[3][7] = new Array();
kaizouValue[3][7][0] = new Array("超制振対策 [2]", "制振〇〇〇 [105] ", 1.05, 1.26, 1.47, 0.0525, -1, 11);
kaizouValue[3][7][1] = new Array("", "コーナー安定〇 [100(全固定)] ", 1.0, 1.2, 1.4, 0.05, -2, 3);
kaizouValue[3][7][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);
kaizouValue[3][8] = new Array();
kaizouValue[3][8][0] = new Array("スラスト角の減少 [4]", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[3][8][1] = new Array("", "スラスト角× [1] ",  -0.01, -0.012, -0.014, -0.0005, -1, 12);

kaizouValue[4] = new Array();
kaizouValue[4][0] = new Array();
kaizouValue[4][0][0] = new Array("タイヤの固定", "パワーロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 7);
kaizouValue[4][0][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[4][1] = new Array();
kaizouValue[4][1][0] = new Array("タイヤの固定", "パワーロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 7);
kaizouValue[4][1][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[4][2] = new Array();
kaizouValue[4][2][0] = new Array("シャフト受けの面取り", "スピードロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 8);
kaizouValue[4][2][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[4][3] = new Array();
kaizouValue[4][3][0] = new Array("軽量化 [4]", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[4][3][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[4][4] = new Array();
kaizouValue[4][4][0] = new Array("限界軽量化 [2]", "重さ〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 5);
kaizouValue[4][4][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[4][4][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);
kaizouValue[4][5] = new Array();
kaizouValue[4][5][0] = new Array("ホイール貫通 [2]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[4][6] = new Array();
kaizouValue[4][6][0] = new Array("ホイールブレの精密調整 [4]", "コーナー安定〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 3);
kaizouValue[4][7] = new Array();
kaizouValue[4][7][0] = new Array("ギヤ精密調整 [4]", "パワーロス〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 7);
kaizouValue[4][7][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);

kaizouValue[5] = new Array();
kaizouValue[5][0] = new Array();
kaizouValue[5][0][0] = new Array("タイヤクリーニング", "パワーロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 7);
kaizouValue[5][0][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[5][1] = new Array();
kaizouValue[5][1][0] = new Array("タイヤウォーミングアップ [4]", "タイヤ摩擦〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 13);
kaizouValue[5][1][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[5][2] = new Array();
kaizouValue[5][2][0] = new Array("タイヤグリップ落とし [4]", "タイヤ旋回〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 14);
kaizouValue[5][2][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[5][3] = new Array();
kaizouValue[5][3][0] = new Array("タイヤ真円出し [4]", "スピードロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 8);
kaizouValue[5][3][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[5][4] = new Array();
kaizouValue[5][4][0] = new Array("トレッドパターン加工 [2]", "タイヤ摩擦〇〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 13);
kaizouValue[5][4][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[5][5] = new Array();
kaizouValue[5][5][0] = new Array("タイヤ面取り [2]", "タイヤ旋回〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 14);
kaizouValue[5][5][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[5][6] = new Array();
kaizouValue[5][6][0] = new Array("スパイク高さ調整 [2]", "オフロード〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 20);
kaizouValue[5][6][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);

kaizouValue[6] = new Array();
kaizouValue[6][0] = new Array();
kaizouValue[6][0][0] = new Array("ネジ締め調整", "スタミナ耐久〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 4);
kaizouValue[6][1] = new Array();
kaizouValue[6][1][0] = new Array("軽量化 [4]", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[6][1][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[6][2] = new Array();
kaizouValue[6][2][0] = new Array("限界軽量化 [2]", "重さ〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 5);
kaizouValue[6][2][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[6][2][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);
kaizouValue[6][3] = new Array();
kaizouValue[6][3][0] = new Array("剛性補強 [4]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[6][3][1] = new Array("", "重さ× [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 5);
kaizouValue[6][4] = new Array();
kaizouValue[6][4][0] = new Array("スラスト角の増加 [4]", "スラスト角〇 [1] ",  0.01, 0.012, 0.014, 0.0005, -1, 12);
kaizouValue[6][4][1] = new Array("", "コーナー安定〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 3);
kaizouValue[6][5] = new Array();
kaizouValue[6][5][0] = new Array("スライドダンパーグリス調整 [4]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[6][5][1] = new Array("", "コーナー安定〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 3);
kaizouValue[6][6] = new Array();
kaizouValue[6][6][0] = new Array("スラスト角の減少 [4]", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[6][6][1] = new Array("", "スラスト角× [1] ",  -0.01, -0.012, -0.014, -0.0005, -1, 12);

kaizouValue[7] = new Array();
kaizouValue[7][0] = new Array();
kaizouValue[7][0][0] = new Array("ネジ締め調整", "スタミナ耐久〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 4);
kaizouValue[7][1] = new Array();
kaizouValue[7][1][0] = new Array("軽量化 [4]", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[7][1][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[7][2] = new Array();
kaizouValue[7][2][0] = new Array("限界軽量化 [2]", "重さ〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 5);
kaizouValue[7][2][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[7][2][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);
kaizouValue[7][3] = new Array();
kaizouValue[7][3][0] = new Array("剛性補強 [4]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[7][3][1] = new Array("", "重さ× [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 5);

kaizouValue[8] = new Array();
kaizouValue[8][0] = new Array();
kaizouValue[8][0][0] = new Array("ネジ締め調整", "スタミナ耐久〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 4);
kaizouValue[8][1] = new Array();
kaizouValue[8][1][0] = new Array("軽量化 [4]", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[8][1][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[8][2] = new Array();
kaizouValue[8][2][0] = new Array("限界軽量化 [2]", "重さ〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 5);
kaizouValue[8][2][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[8][2][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);
kaizouValue[8][3] = new Array();
kaizouValue[8][3][0] = new Array("剛性補強 [4]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[8][3][1] = new Array("", "重さ× [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 5);

kaizouValue[9] = new Array();
kaizouValue[9][0] = new Array();
kaizouValue[9][0][0] = new Array("ローラーチェック", "ローラー摩擦〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 17);
kaizouValue[9][0][1] = new Array("", "コーナー安定〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 3);
kaizouValue[9][1] = new Array();
kaizouValue[9][1][0] = new Array("ローラー摩擦を強める [4]", "ローラー摩擦〇〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 17);
kaizouValue[9][1][1] = new Array("", "コーナー安定〇〇 [8] ", 0.08, 0.096, 0.112, 0.004, -1, 3);
kaizouValue[9][2] = new Array();
kaizouValue[9][2][0] = new Array("ローラー摩擦を弱める [4]", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[9][2][1] = new Array("", "ローラー摩擦×× [5]", -0.05, -0.06, -0.07, -0.0025, -1, 17);
kaizouValue[9][3] = new Array();
kaizouValue[9][3][0] = new Array("ローラー抵抗抜き [2]", "ローラー抵抗〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 18);
kaizouValue[9][3][1] = new Array("", "コーナー安定〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 3);
kaizouValue[9][4] = new Array();
kaizouValue[9][4][0] = new Array("ローラー軽量化 [4]", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);

kaizouValue[10] = new Array();
kaizouValue[10][0] = new Array();
kaizouValue[10][0][0] = new Array("軽量化", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[10][0][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[10][1] = new Array();
kaizouValue[10][1][0] = new Array("ｴｱﾛﾀﾞｳﾝﾌｫｰｽ増加 [4]", "ｴｱﾛﾀﾞｳﾝﾌｫｰｽ〇 [5] ", 0.05, 0.06, 0.07, 0.0025, -1, 9);
kaizouValue[10][1][1] = new Array("", "コーナー安定〇 [50(全固定)] ", 1.0, 1.2, 1.4, 0.025, -2, 3);
kaizouValue[10][2] = new Array();
kaizouValue[10][2][0] = new Array("ｴｱﾛﾀﾞｳﾝﾌｫｰｽ減少 [4]", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[10][2][1] = new Array("", "ｴｱﾛﾀﾞｳﾝﾌｫｰｽ× [5] ", -0.05, -0.06, -0.07, -0.0025, -1, 9);
kaizouValue[10][3] = new Array();
kaizouValue[10][3][0] = new Array("スライドダンパーグリス調整 [4]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[10][3][1] = new Array("", "コーナー安定〇 [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 3);

kaizouValue[11] = new Array();
kaizouValue[11][0] = new Array();
kaizouValue[11][0][0] = new Array("スタビチェック", "スタビ減速〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 24);
kaizouValue[11][1] = new Array();
kaizouValue[11][1][0] = new Array("スタビ摩擦を強める [4]", "スタビ減速〇〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 24);
kaizouValue[11][1][1] = new Array("", "コーナー安定〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 3);
kaizouValue[11][2] = new Array();
kaizouValue[11][2][0] = new Array("スタビ摩擦を弱める [4]", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[11][2][1] = new Array("", "スタビ減速×× [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 24);

kaizouValue[12] = new Array();
kaizouValue[12][0] = new Array();

kaizouValue[13] = new Array();
kaizouValue[13][0] = new Array();
kaizouValue[13][0][0] = new Array("ターミナルチェック", "節電〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 10);
kaizouValue[13][0][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[13][1] = new Array();
kaizouValue[13][1][0] = new Array("ターミナル磨き [4]", "節電〇〇 [5] ", 0.05, 0.06, 0.07, 0.0025, -1, 10);
kaizouValue[13][1][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[13][2] = new Array();
kaizouValue[13][2][0] = new Array("ターミナル位置の固定 [2]", "パワーロス〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 7);
kaizouValue[13][2][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);

kaizouValue[14] = new Array();
kaizouValue[14][0] = new Array();
kaizouValue[14][0][0] = new Array("冷却能力向上", "節電〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 10);
kaizouValue[14][0][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[14][1] = new Array();
kaizouValue[14][1][0] = new Array("軽量化", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[14][1][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[14][2] = new Array();
kaizouValue[14][2][0] = new Array("剛性補強", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);

kaizouValue[15] = new Array();
kaizouValue[15][0] = new Array();
kaizouValue[15][0][0] = new Array("ギヤメンテ", "ギヤ負荷〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 6);
kaizouValue[15][0][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[15][1] = new Array();
kaizouValue[15][1][0] = new Array("ギヤ慣らし", "パワーロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 7);
kaizouValue[15][1][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[15][2] = new Array();
kaizouValue[15][2][0] = new Array("ギヤ研磨 [4]", "ギヤ負荷〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 6);
kaizouValue[15][2][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);

kaizouValue[16] = new Array();
kaizouValue[16][0] = new Array();
kaizouValue[16][0][0] = new Array("プロペラシャフトメンテ", "ギヤ負荷〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 6);
kaizouValue[16][0][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[16][1] = new Array();
kaizouValue[16][1][0] = new Array("ギヤ慣らし", "パワーロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 7);
kaizouValue[16][1][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[16][2] = new Array();
kaizouValue[16][2][0] = new Array("ギヤ研磨 [4]", "ギヤ負荷〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 6);
kaizouValue[16][2][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);

kaizouValue[17] = new Array();
kaizouValue[17][0] = new Array();
kaizouValue[17][0][0] = new Array("ベアリングメンテ", "スピードロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 8);
kaizouValue[17][0][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[17][1] = new Array();
kaizouValue[17][1][0] = new Array("ベアリング慣らし [4]", "スピードロス〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 8);
kaizouValue[17][1][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[17][2] = new Array();
kaizouValue[17][2][0] = new Array("ベアリング抵抗減少 [2]", "スピードロス〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 8);
kaizouValue[17][2][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);

kaizouValue[18] = new Array();
kaizouValue[18][0] = new Array();
kaizouValue[18][0][0] = new Array("回転ブレのチェック", "スピードロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 8);
kaizouValue[18][0][1] = new Array("", "スピード〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 1);
kaizouValue[18][1] = new Array();
kaizouValue[18][1][0] = new Array("シャフトチェック", "スピードロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 8);
kaizouValue[18][1][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[18][2] = new Array();
kaizouValue[18][2][0] = new Array("滑り止め加工 [4]", "スタミナ耐久〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 4);

kaizouValue[19] = new Array();
kaizouValue[19][0] = new Array();
kaizouValue[19][0][0] = new Array("回転ブレのチェック", "パワーロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 7);
kaizouValue[19][0][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);
kaizouValue[19][1] = new Array();
kaizouValue[19][1][0] = new Array("ギヤシャフト固定 [2]", "パワーロス〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 7);
kaizouValue[19][1][1] = new Array("", "パワー〇 [200(全固定)] ", 1.0, 1.2, 1.4, 0.1, -2, 2);

kaizouValue[20] = new Array();
kaizouValue[20][0] = new Array();

kaizouValue[21] = new Array();
kaizouValue[21][0] = new Array();

var calcFlg = 0;
var resultFlg = 0;
function All_Set() {
	calcFlg = 0;
	resultFlg = 0;
	for (var i = 0; i < nameValue.length; i++) {
		Type_Init(i);
		document.getElementById(nameValue[i] + i + '_oldselect').value = -1;
		Type_Set(i, 1);
	}
	UrlSet();
	calcFlg = 1;
	for (var i = 0; i < nameValue.length; i++) {
		Type_Calc(i);
	}
	resultFlg = 1;
	Type_Calc(0);
}

function View_Set(value1) {
	var writeValue = "<table class='cstable'><tr><td>" + nameView[value1];
	writeValue += "<span id='id_" + nameValue[value1] + value1 + "'></span></td>";
	if (value1 == 2) {
		writeValue += "<td class='cstd'>　</td>";
		writeValue += "<td>肉抜き <select id='" + nameValue[value1] + value1 + "_niku' onchange='Type_Calc(" + value1 + ")'>";
		writeValue += "<option value=0>なし</option>";
		for (var j = 1; j <= 5; j++) {
			writeValue += "<option value=" + j + ">" + j + "箇所</option>";
		}
		writeValue += "</td>";
	}
	if (kaizouSelect[nameCalc[value1]][0].length != 0) {
		writeValue += "<td class='cstd'>　</td>"
		writeValue += "<td>パーツプリセット <input class='csinput' type='text' id='" + nameValue[value1] + value1 + "_pres' value=''> <input type='button' value='装着' onclick='Preset_Set(" + value1 + ")'> </td>";
		writeValue += "<td class='cstd'>　</td>"
		writeValue += "<td>改造 <input type='button' value='初期化' onclick='Shokika_Set(" + value1 + ")'> </td>";
	}
	if (value1 == 2) {
		writeValue += "</tr></table>";
		writeValue += "</tr></table><table class='cstable'><tr><td class='cstd'>　</td>";
		writeValue += "<td>メイン特性 <select id='" + nameValue[value1] + value1 + "_bodytokusei1' onchange='Type_Calc(" + value1 + ")'>";
		for (var i = 0; i < selectOption.length; i++) {
			writeValue += "<option value=" + i + ">" + selectOption[i] + "</option>";
		}
		writeValue += "</select></td><td>アシストA特性 <select id='" + nameValue[value1] + value1 + "_bodytokusei2' onchange='Type_Calc(" + value1 + ")'>";
		for (var i = 0; i <= 20; i++) {
			writeValue += "<option value=" + i + ">" + selectOption[i] + "</option>";
		}
		writeValue += "</select> ※ 仮 </td><td>アシストB特性 <select id='" + nameValue[value1] + value1 + "_bodytokusei3' onchange='Type_Calc(" + value1 + ")'>";
		for (var i = 0; i <= 20; i++) {
			writeValue += "<option value=" + i + ">" + selectOption[i] + "</option>";
		}
		writeValue += "</select> ※ 仮 </td>";
	}
	writeValue += "</tr></table><table class='cstable'><tr><td class='cstd'>　</td>";
	for (var i = 0; i < typeSelect[nameCalc[value1]].length; i++) {
		if (i == 5 || i == 10 || i == 15) {
			writeValue += "</tr><tr><td class='cstd'>　</td>";
		}
		writeValue += "<td>" + typeView[typeSelect[nameCalc[value1]][i]] + "<input class='csinput' type='text' id='" + nameValue[value1] + "_" + typeValue[typeSelect[nameCalc[value1]][i]] + value1 + "' value=''><br>改造後 <input class='csinput' type='text' id='" + nameValue[value1] + "_" + typeValue[typeSelect[nameCalc[value1]][i]] + value1 + "_kaisv' value=''></td>";
	}
	writeValue += "</tr></table>";
	if (kaizouSelect[nameCalc[value1]][0].length != 0) {
		writeValue += "<table class='cstable'>";
		for (var i = 1; i <= 6; i++) {
			writeValue += "<tr><td class='cstd'>　</td><td>スロット" + i + " ";
			writeValue += "<span id='id_" + nameValue[value1] + value1 + "_slot" + i + "'></span><br>";
			if (i == 1) {
				writeValue += " <input type='button' value='Lv一括' onclick='Lv_Set(" + value1 + ")'>　";
			}
			writeValue += "<select id='" + nameValue[value1] + value1 + "_type" + i + "' onchange='Type_Calc(" + value1 + ")'>";
			writeValue += "<option value=2>イイ感じ</option><option value=3>職人技</option><option value=4 selected>至高の逸品</option></select>　強化Lv ";
			writeValue += "<select id='" + nameValue[value1] + value1 + "_lv" + i + "' onchange='Type_Calc(" + value1 + ")'>";
			for (var j = 1; j < 50; j++) {
				writeValue += "<option value=" + j + ">" + j + "</option>";
			}
			writeValue += "<option value=" + 50 + " selected>" + 50 + "</option></select></td>";
			for (var j = 1; j <= 3; j++) {
				writeValue += "<td><span id='id_" + nameValue[value1] + value1 + "_slot" + i + "_" + j + "'></span><br><input class='csinput' type='text' id='" + nameValue[value1] + value1 + "_slot" + i + "_" + j +"' value=''></td>";
			}
			writeValue += "</tr>";
		}
		writeValue += "</table>";
	}
	writeValue += "<input type='hidden' id='" + nameValue[value1] + value1 + "_url' value=''>";
	writeValue += "<input type='hidden' id='" + nameValue[value1] + value1 + "_oldselect' value='-1'>";
	document.write(writeValue);
}

function Type_Init(value1) {
	var innerValue = "<select id='" + nameValue[value1] + value1 + "' onchange='Type_Set(" + value1 + ", " + nameUpdate[nameCalc[value1]] + ")'>";
	for (var i = 0; i < selectValue[nameCalc[value1]].length; i++) {
		innerValue += "<option value=" + i + ">" + selectValue[nameCalc[value1]][i][0] + " [" + selectProper[selectValue[nameCalc[value1]][i][1]] + "]";
		if (value1 == 2) {
			innerValue += " [" + selectOption[selectValue[nameCalc[value1]][i][2]] + "]";
		}
		innerValue += "</option>";
	}
	document.getElementById("id_" + nameValue[value1] + value1).innerHTML = innerValue + "</select>";
}

function Type_Set(value1, value2) {
	var index = document.getElementById(nameValue[value1] + value1).value;
	if (kaizouSelect[nameCalc[value1]][0].length != 0) {
		var sameFlg = 1;
		if (value2 == 1) {
			var oldIndex = document.getElementById(nameValue[value1] + value1 + '_oldselect').value;
			if (oldIndex != -1 && kaizouSelect[nameCalc[value1]][kaizouSelectIndex[nameCalc[value1]][index]].length == kaizouSelect[nameCalc[value1]][kaizouSelectIndex[nameCalc[value1]][oldIndex]].length) {
				for (var j = 0; j < kaizouSelect[nameCalc[value1]][kaizouSelectIndex[nameCalc[value1]][index]].length; j++) {
					if (kaizouSelect[nameCalc[value1]][kaizouSelectIndex[nameCalc[value1]][index]][j] != kaizouSelect[nameCalc[value1]][kaizouSelectIndex[nameCalc[value1]][oldIndex]][j]) {
						sameFlg = -1;
						break;
					}
				}
			} else {
				sameFlg = -1;
			}
		}
		if (sameFlg == -1 || (index == 0 && nameZero[nameCalc[value1]] == 1)) {
			var innerValue = "";
			for (var i = 1; i <= 6; i++) {
				innerValue = "<select id='" + nameValue[value1] + value1 + "_slot" + i + "' onchange='Type_Slot_Set(" + value1 + ", " +  (i - 1) + ")'>";
				innerValue += "<option value=-1 selected>改造選択</option>";
				for (var j = 0; j < kaizouSelect[nameCalc[value1]][kaizouSelectIndex[nameCalc[value1]][index]].length; j++) {
					innerValue += "<option value=" + kaizouSelect[nameCalc[value1]][kaizouSelectIndex[nameCalc[value1]][index]][j] + ">" + kaizouValue[nameCalc[value1]][kaizouSelect[nameCalc[value1]][kaizouSelectIndex[nameCalc[value1]][index]][j]][0][0] + "</option>";
				}
				document.getElementById("id_" + nameValue[value1] + value1 + "_slot" + i).innerHTML = innerValue + "</select>";
				for (var j = 0; j < 3; j++) {
					document.getElementById("id_" + nameValue[value1] + value1 + "_slot" + i + "_" + (j + 1)).innerHTML = "";
				}
			}
		}
	}
	if (value1 == 2) {
		var bodyIndex = document.getElementById(nameValue[2] + "2").value;
		var bodyOption = selectValue[2][bodyIndex][2];
		var calcFlgOrg = calcFlg;
		calcFlg = 0;
		document.getElementById(nameValue[value1] + value1 + '_bodytokusei1').selectedIndex = bodyOption;
		calcFlg = calcFlgOrg;
	}
	for (var i = 0; i < typeSelect[nameCalc[value1]].length; i++) {
		document.getElementById(nameValue[value1] + '_' + typeValue[typeSelect[nameCalc[value1]][i]] + value1).value = selectValue[nameCalc[value1]][index][typeSelect[nameCalc[value1]][i] + 2];
	}
	document.getElementById(nameValue[value1] + value1 + '_oldselect').value = index;
	Type_Calc(value1);
}

function Type_Slot_Set(value1, value2) {
	var index = document.getElementById(nameValue[value1] + value1 + '_slot' + (value2 + 1)).value;
	for (var j = 0; j < 3; j++) {
		document.getElementById("id_" + nameValue[value1] + value1 + "_slot" + (value2 + 1) + "_" + (j + 1)).innerHTML = "";
	}
	if (index != -1) {
		for (var j = 0; j < kaizouValue[nameCalc[value1]][index].length; j++) {
			document.getElementById("id_" + nameValue[value1] + value1 + "_slot" + (value2 + 1) + "_" + (j + 1)).innerHTML = kaizouValue[nameCalc[value1]][index][j][1];
		}
	}
	Type_Calc(value1);
}

function Type_Calc(value1) {
	if (calcFlg == 0) return 0;
	if (kaizouSelect[nameCalc[value1]][0].length == 0) {
		var nameIndex = document.getElementById(nameValue[value1] + value1).value;
		var calcValue = new Array(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0); //25
		for (var i = 1; i < selectValue[nameCalc[value1]][nameIndex].length - 2; i++) {
			calcValue[i] = selectValue[nameCalc[value1]][nameIndex][i + 2];
		}
		for (var i = 0; i < typeSelect[nameCalc[value1]].length; i++) {
			document.getElementById(nameValue[value1] + "_" + typeValue[typeSelect[nameCalc[value1]][i]] + value1 + "_kaisv").value = calcValue[typeSelect[nameCalc[value1]][i]];
		}
	} else {
		for (var i = 1; i <= 6; i++) {
			for (var j = 1; j <= 3; j++) {
				document.getElementById(nameValue[value1] + value1 + "_slot" + i + "_" + j).value = "";
			}
		}
		var nameIndex = document.getElementById(nameValue[value1] + value1).value;
		var calcValueSv = new Array(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0); //25
		var calcValueSvInit = new Array(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0); //25
		for (var i = 1; i < selectValue[nameCalc[value1]][nameIndex].length - 2; i++) {
			calcValueSv[i] = selectValue[nameCalc[value1]][nameIndex][i + 2];
			calcValueSvInit[i] = selectValue[nameCalc[value1]][nameIndex][i + 2];
		}
		for (var i = 1; i <= 6; i++) {
			var slotIndex = document.getElementById(nameValue[value1] + value1 + '_slot' + i).value;
			if (slotIndex == -1) continue;
			var typeVal = document.getElementById(nameValue[value1] + value1 + '_type' + i).value;
			var lvVal = document.getElementById(nameValue[value1] + value1 + '_lv' + i).value;
			for (var j = 0; j < kaizouValue[nameCalc[value1]][slotIndex].length; j++) {
				var typeIndex = kaizouValue[nameCalc[value1]][slotIndex][j][7];
				var kaizouVal = 0.0;
				if (kaizouValue[nameCalc[value1]][slotIndex][j][6] == -1) {
					kaizouVal = Math.abs(selectValue[nameCalc[value1]][nameIndex][typeIndex + 2]) * kaizouValue[nameCalc[value1]][slotIndex][j][typeVal];
				} else {
					kaizouVal = kaizouValue[nameCalc[value1]][slotIndex][j][typeVal];
				}
				var kyoukaValSv = 0.0;
				if (kaizouValue[nameCalc[value1]][slotIndex][j][6] == -2) {
					kyoukaValSv = kaizouValue[nameCalc[value1]][slotIndex][j][5] * lvVal;
				} else {
					kyoukaValSv = Math.abs(calcValueSvInit[typeIndex]) * kaizouValue[nameCalc[value1]][slotIndex][j][5] * lvVal;
				}
				document.getElementById(nameValue[value1] + value1 + "_slot" + i + "_" + (j + 1)).value = kaizouVal + kyoukaValSv;
				calcValueSv[typeIndex] += kaizouVal + kyoukaValSv;
				if (calcValueSv[typeIndex] < 0 && typeIndex != 12) calcValueSv[typeIndex] = 0;
			}
		}
		if (value1 == 2) {
			var nikuVal = document.getElementById(nameValue[value1] + value1 + '_niku').selectedIndex;
			calcValueSv[5] -= nikuVal * 0.32;
		}
		for (var i = 0; i < typeSelect[nameCalc[value1]].length; i++) {
			document.getElementById(nameValue[value1] + "_" + typeValue[typeSelect[nameCalc[value1]][i]] + value1 + "_kaisv").value = calcValueSv[typeSelect[nameCalc[value1]][i]];
		}
	}
	UrlCalc(value1);
	if (resultFlg == 0) return 0;
	Result_Calc();
	UrlView();
}

function Result_Calc() {
	var resultValue = new Array(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0); //25
	var resultValueKai = new Array(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0); //25
	var resultValueKaiSv = new Array(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0); //25
	var disp1 = window.parent.results.document.getElementById('disp1').checked;
	for (var value0 = 0; value0 < nameValue.length; value0++) {
		var disp1Flg = 0;
		if (disp1) {
			if (value0 >= 27 && value0 <= 32) {
				if (window.parent.mains.document.getElementById(nameValue[value0] + value0).value == 0) disp1Flg = 1;
			}
		}
		for (var i = 0; i < typeSelect[nameCalc[value0]].length; i++) {
			if (disp1Flg == 1 && typeSelect[nameCalc[value0]][i] != 5) continue;
			resultValue[typeSelect[nameCalc[value0]][i]] += 1 * window.parent.mains.document.getElementById(nameValue[value0] + "_" + typeValue[typeSelect[nameCalc[value0]][i]] + value0).value;
			resultValueKaiSv[typeSelect[nameCalc[value0]][i]] += 1 * window.parent.mains.document.getElementById(nameValue[value0] + "_" + typeValue[typeSelect[nameCalc[value0]][i]] + value0 + "_kaisv").value;
		}
	}
	for (var i = 1; i < typeValue.length; i++) {
		window.parent.results.document.getElementById(typeValue[i]).value = resultValue[i];
		window.parent.results.document.getElementById(typeValue[i] + "_kaisv").value = resultValueKaiSv[i];
		if (resultValue[i] == 0) {
			window.parent.results.document.getElementById(typeValue[i] + "_rate").value = 0;
		} else {
			window.parent.results.document.getElementById(typeValue[i] + "_rate").value = resultValueKaiSv[i] / resultValue[i] * 100.0 - 100.0;
		}
	}
	Diagnosis_Calc(resultValueKaiSv);
}

function Diagnosis_Calc(resultValueKai) {
	var shindantire = 1;
	if (window.parent.diagnosis.document.getElementById('shindantire2').checked) {
		shindantire = 2;
	} else if (window.parent.diagnosis.document.getElementById('shindantire3').checked) {
		shindantire = 3;
	} else if (window.parent.diagnosis.document.getElementById('shindantire4').checked) {
		shindantire = 4;
	}
	//ローラースラスト角
	var rollerangleValue = Math.min(10, Math.max(0, resultValueKai[12]));
	window.parent.diagnosis.document.getElementById(diagnosisValue[10]).value = rollerangleValue;
	//重さ
	window.parent.diagnosis.document.getElementById(diagnosisValue[11]).value = resultValueKai[5];
	//ブレーキ性能
	var brakeValue = resultValueKai[23] / 2000.0;
	//var bodyIndex = window.parent.mains.document.getElementById(nameValue[2] + "2").value;
	//var bodyOption = selectValue[2][bodyIndex][2];
	var bodyOption1 = window.parent.mains.document.getElementById(nameValue[2] + "2_bodytokusei1").selectedIndex;
	var bodyOption2 = window.parent.mains.document.getElementById(nameValue[2] + "2_bodytokusei2").selectedIndex;
	var bodyOption3 = window.parent.mains.document.getElementById(nameValue[2] + "2_bodytokusei3").selectedIndex;
	if (brakeValue != 0 && bodyOption1 == 6) brakeValue += 0.05;
	if (brakeValue != 0 && bodyOption2 == 6) brakeValue += 0.025;
	if (brakeValue != 0 && bodyOption3 == 6) brakeValue += 0.025;
	window.parent.diagnosis.document.getElementById(diagnosisValue[12]).value = brakeValue;
	//タイヤグリップ
	var ftiregripValue = window.parent.mains.document.getElementById(nameValue[6] + "_" + typeValue[13] + "6_kaisv").value;
	window.parent.diagnosis.document.getElementById(diagnosisValue[5]).value = ftiregripValue / 100.0;
	//バッテリー消費量
	var setsudenUp = 1.0;
	var setsudenValue = resultValueKai[10];
	if (setsudenValue != 0 && bodyOption1 == 8) setsudenUp += 0.6;
	if (setsudenValue != 0 && bodyOption1 == 18) setsudenUp += 0.8;
	if (setsudenValue != 0 && bodyOption2 == 8) setsudenUp += 0.3;
	if (setsudenValue != 0 && bodyOption2 == 18) setsudenUp += 0.4;
	if (setsudenValue != 0 && bodyOption3 == 8) setsudenUp += 0.3;
	if (setsudenValue != 0 && bodyOption3 == 18) setsudenUp += 0.4;
	window.parent.diagnosis.document.getElementById(diagnosisValue[2]).value = resultValueKai[22] * (1 - setsudenValue * setsudenUp / 10000.0);
	//加速度(毎秒)
	var ftireValue = window.parent.mains.document.getElementById(nameValue[6] + "_" + typeValue[16] + "6_kaisv").value;
	var rtireValue = window.parent.mains.document.getElementById(nameValue[7] + "_" + typeValue[16] + "7_kaisv").value;
	var bodyPower = 1.0;
	if (bodyOption1 == 2) bodyPower += 0.02;
	if (bodyOption1 == 12) bodyPower += 0.03;
	if (bodyOption2 == 2) bodyPower += 0.01;
	if (bodyOption2 == 12) bodyPower += 0.015;
	if (bodyOption3 == 2) bodyPower += 0.01;
	if (bodyOption3 == 12) bodyPower += 0.015;
	var acceleValue = (10.0 * bodyPower * resultValueKai[2] * (1.0 - resultValueKai[7] / 10000.0) * resultValueKai[21] - resultValueKai[6]) / (2.0 * rtireValue * resultValueKai[5]);
	var acceleValue2;
	if ((shindantire == 1 && Math.abs(ftireValue - rtireValue) == 1) || shindantire == 3) {
		acceleValue2 = acceleValue - Math.max(resultValueKai[8] - 5000.0, 0.0) / 40000.0;
	} else if ((shindantire == 1 && ftireValue != rtireValue) || shindantire == 2) {
		acceleValue2 = acceleValue;
	} else {
		acceleValue2 = acceleValue - resultValueKai[8] / 40000.0;
	}
	window.parent.diagnosis.document.getElementById(diagnosisValue[3]).value = acceleValue2;
	//最高速度
	var bodySpeed = 1.0;
	if (bodyOption1 == 1) bodySpeed += 0.02;
	if (bodyOption1 == 11) bodySpeed += 0.03;
	if (bodyOption1 == 21) bodySpeed += 0.04;
	if (bodyOption2 == 1) bodySpeed += 0.01;
	if (bodyOption2 == 11) bodySpeed += 0.015;
	if (bodyOption2 == 21) bodySpeed += 0.02;
	if (bodyOption3 == 1) bodySpeed += 0.01;
	if (bodyOption3 == 11) bodySpeed += 0.015;
	if (bodyOption3 == 21) bodySpeed += 0.02;
	var spowerValue = (1.0 - resultValueKai[6] / (10.0 * bodyPower * resultValueKai[2] * resultValueKai[21])) - resultValueKai[7] / 10000.0;
	var speedValue = 3.14159265359 * rtireValue * spowerValue * 10.0 * bodySpeed * resultValueKai[1] / (60000.0 * resultValueKai[21]) - 0.001 * resultValueKai[9];
	var speedlossValue = resultValueKai[5] * 3.14159265359 * 10.0 * bodySpeed * resultValueKai[1] * rtireValue * rtireValue / (10.0 * bodyPower * resultValueKai[2] * resultValueKai[21] * resultValueKai[21] * 300.0 * 2000.0 * 2000.0);
	var speedValue2;
	if ((shindantire == 1 && Math.abs(ftireValue - rtireValue) == 1) || shindantire == 3) {
		speedValue2 = speedValue - speedlossValue * Math.max(resultValueKai[8] - 5000.0, 0.0);
	} else if ((shindantire == 1 && ftireValue != rtireValue) || shindantire == 2) {
		speedValue2 = speedValue;
	} else {
		speedValue2 = speedValue - speedlossValue * resultValueKai[8];
	}
	window.parent.diagnosis.document.getElementById(diagnosisValue[0]).value = speedValue2 * 3.6;
	window.parent.diagnosis.document.getElementById(diagnosisValue[1]).value = speedValue2;
	//ジャンプ飛距離
	var jumpValue = Math.sin(2.0 * 20.0 * (Math.PI / 180.0)) / 9.80665;
	window.parent.diagnosis.document.getElementById(diagnosisValue[7]).value = speedValue2 * speedValue2 * jumpValue;
	//前後の重心
	var chassisIndex = window.parent.mains.document.getElementById(nameValue[3] + "3").value;
	var gravityValue = 0.0;
	var baseGravityIndex = 0;
	if (window.parent.mains.document.getElementById(nameValue[13] + "13").value != 0 || window.parent.mains.document.getElementById(nameValue[16] + "16").value != 0 || window.parent.mains.document.getElementById(nameValue[17] + "17").value != 0 || window.parent.mains.document.getElementById(nameValue[18] + "18").value != 0) {
		baseGravityIndex = 1;
	}
	if (window.parent.mains.document.getElementById(nameValue[10] + "10").value == 2 || window.parent.mains.document.getElementById(nameValue[10] + "10").value == 4) {
		baseGravityIndex += 2;
	}
	for (var i = 0; i < nameValue.length; i++) {
		var weightValue = window.parent.mains.document.getElementById(nameValue[i] + "_" + typeValue[5] + i + "_kaisv").value;
		if (i == 3) {
			gravityValue += baseGravity[baseGravityIndex][chassisIndex] * chassisGravity[chassisIndex] * weightValue;
		} else {
			gravityValue += baseGravity[baseGravityIndex][chassisIndex] * partsGravity[i] * weightValue;
		}
	}
	gravityValue = gravityValue / resultValueKai[5];
	window.parent.diagnosis.document.getElementById(diagnosisValue[9]).value = gravityValue;


}

function View_Result() {
	document.write("<table class='cstable'><tr>");
	document.write("<td><input class='csinput1' type='radio' id='disp1' name='disp' onchange='Result_Calc()'>旧アプリ表示　");
	document.write("<input class='csinput1' type='radio' id='disp2' name='disp' onchange='Result_Calc()' checked>標準アクセサリー適用表示　</td>");
	document.write("</tr></table><table class='cstable'><tr><td class='cstd'>　</td>");
	for (var i = 1; i < typeValue.length; i++) {
		if (i == 6 || i == 11 || i == 16 || i == 21) {
			document.write("</tr>");
			document.write("<tr><td class='cstd'>　</td>");
		}
		document.write("<td>" + typeView[i] + "<input class='csinput' type='text' id='" + typeValue[i] + "' value=''><br>改造後 <input class='csinput' type='text' id='" + typeValue[i] + "_kaisv' value=''><br>改造比率[%] <input class='csinput' type='text' id='" + typeValue[i] + "_rate' value=''></td>");
	}
	document.write("</tr></table>");
	document.write("<br><a href='' id='linkurl' target='_blank' rel='noopener'>プリセットURL</a>");
	document.write("<table class='cstable'><tr><td class='cstd'>　</td><td><input class='csinput2' type='text' id='dispurl' value=''></td></tr></table>");
}

function View_Diagnosis() {
	document.write("<table class='cstable'><tr>");
	document.write("<td><input class='csinput1' type='radio' id='shindantire1' name='shindantire' onchange='Result_Calc()' checked>マシン診断　");
	document.write("<input class='csinput1' type='radio' id='shindantire2' name='shindantire' onchange='Result_Calc()'>タイヤ異径表示　");
	document.write("<input class='csinput1' type='radio' id='shindantire3' name='shindantire' onchange='Result_Calc()'>タイヤ径差1表示　");
	document.write("<input class='csinput1' type='radio' id='shindantire4' name='shindantire' onchange='Result_Calc()'>タイヤ同径表示　</td>");	
	document.write("</tr></table><table class='cstable'><tr><td class='cstd'>　</td>");
	for (var i = 0; i < diagnosisValue.length; i++) {
		if (i == 4 || i == 8 || i == 12 || i == 16) {
			document.write("</tr>");
			document.write("<tr><td class='cstd'>　</td>");
		}
		document.write("<td>" + diagnosisView[i] + "<input class='csinput' type='text' id='" + diagnosisValue[i] + "' value=''></td>");
	}
	document.write("</tr></table>");
	document.write("<br><font color='#FFA500'>※1 タイヤ同径・異径・径差1対応</font>");
	document.write("<br><font color='#FFA500'>※2 参考値です(ブレーキは考慮せず、速いマシンの場合は表示より少し大きくなり、遅い場合は少し小さくなります)</font>");
	document.write("<br><font color='#FFA500'>※3 スーパー1、ゼロ、タイプ1、2、3、FM、スーパーFMシャーシ対応(スーパー1強化、スーパーTZシャーシは不明)</font>");
}

function UrlCalc(value1) {
	var urlValue = NumToUrl(document.getElementById(nameValue[value1] + value1).selectedIndex);
	if (kaizouSelect[nameCalc[value1]][0].length != 0) {
		for (var i = 1; i <= 6; i++) {
			urlValue += NumToUrl(document.getElementById(nameValue[value1] + value1 + '_slot' + i).selectedIndex);
			urlValue += NumToUrl(document.getElementById(nameValue[value1] + value1 + '_type' + i).selectedIndex);
			urlValue += NumToUrl(document.getElementById(nameValue[value1] + value1 + '_lv' + i).selectedIndex);
		}
		if (value1 == 2) {
			urlValue += NumToUrl(document.getElementById(nameValue[value1] + value1 + '_niku').selectedIndex);
			urlValue += NumToUrl(0);
			urlValue += NumToUrl(0);
		}
		document.getElementById(nameValue[value1] + value1 + "_pres").value = urlValue;
	}
	document.getElementById(nameValue[value1] + value1 + "_url").value = urlValue;
}

function UrlView() {
	var urlValue = "";
	for (var value0 = 0; value0 < nameValue.length; value0++) {
		urlValue += document.getElementById(nameValue[value0] + value0 + "_url").value;
	}
	var url = window.parent.document.location.href;
	var start = url.indexOf("?", 0);
	var urlInit = url;
	if (start != -1) urlInit = url.substring(0, start);
	window.parent.results.document.getElementById('linkurl').href = urlInit + "?" + urlValue;
	window.parent.results.document.getElementById('dispurl').value = urlInit + "?" + urlValue;
}

function UrlSet() {
	var url = window.parent.document.location.href;
	var start = url.indexOf("?", 0);
	if (start != -1) {
		var presetText = url.substring(start + 1);
		var index = 0;
		var pos = 0;
		if (presetText.length >= (19 * (nameValue.length - 5) + 5 + 3)) {
			for (var value1 = 0; value1 < nameValue.length; value1++) {
				var str = presetText.charAt(pos++);
				if (str == "0") str += presetText.charAt(pos++);
				index = UrlToNum(str);
				document.getElementById(nameValue[value1] + value1).selectedIndex = index;
				Type_Set(value1, nameUpdate[nameCalc[value1]]);
				if (kaizouSelect[nameCalc[value1]][0].length != 0) {
					for (var i = 1; i <= 6; i++) {
						index = UrlToNum(presetText.charAt(pos++));
						document.getElementById(nameValue[value1] + value1 + '_slot' + i).selectedIndex = index;
						index = UrlToNum(presetText.charAt(pos++));
						document.getElementById(nameValue[value1] + value1 + '_type' + i).selectedIndex = index;
						index = UrlToNum(presetText.charAt(pos++));
						document.getElementById(nameValue[value1] + value1 + '_lv' + i).selectedIndex = index;
						Type_Slot_Set(value1, i - 1);
					}
					if (value1 == 2) {
						index = UrlToNum(presetText.charAt(pos++));
						document.getElementById(nameValue[value1] + value1 + '_niku').selectedIndex = index;
						index = UrlToNum(presetText.charAt(pos++));
						index = UrlToNum(presetText.charAt(pos++));
					}
				}
			}
		}
	}
}

function Preset_Set(value1) {
	var presetText = document.getElementById(nameValue[value1] + value1 + "_pres").value;
	var index = 0;
	var pos = 0;
	if ((value1 != 2 && presetText.length >= 19) || (value1 == 2 && presetText.length >= 22)) {
		var str = presetText.charAt(pos++);
		if (str == "0") str += presetText.charAt(pos++);
		index = UrlToNum(str);
		document.getElementById(nameValue[value1] + value1).selectedIndex = index;
		Type_Set(value1, nameUpdate[nameCalc[value1]]);
		for (var i = 1; i <= 6; i++) {
			index = UrlToNum(presetText.charAt(pos++));
			document.getElementById(nameValue[value1] + value1 + '_slot' + i).selectedIndex = index;
			index = UrlToNum(presetText.charAt(pos++));
			document.getElementById(nameValue[value1] + value1 + '_type' + i).selectedIndex = index;
			index = UrlToNum(presetText.charAt(pos++));
			document.getElementById(nameValue[value1] + value1 + '_lv' + i).selectedIndex = index;
			Type_Slot_Set(value1, i - 1);
		}
		if (value1 == 2) {
			index = UrlToNum(presetText.charAt(pos++));
			document.getElementById(nameValue[value1] + value1 + '_niku').selectedIndex = index;
			index = UrlToNum(presetText.charAt(pos++));
			index = UrlToNum(presetText.charAt(pos++));
		}
		Type_Set(value1, nameUpdate[nameCalc[value1]]);
	} else {
		for (var i = 1; i <= 6; i++) {
			document.getElementById(nameValue[value1] + value1 + '_slot' + i).selectedIndex = 0;
			Type_Slot_Set(value1, i - 1);
		}
	}
}

function Lv_Set(value1) {
	var index = document.getElementById(nameValue[value1] + value1 + '_lv' + 1).selectedIndex;
	for (var i = 2; i <= 6; i++) {
		document.getElementById(nameValue[value1] + value1 + '_lv' + i).selectedIndex = index;
		Type_Slot_Set(value1, i - 1);
	}
}

function Shokika_Set(value1) {
	for (var i = 1; i <= 6; i++) {
		document.getElementById(nameValue[value1] + value1 + '_slot' + i).selectedIndex = 0;
		Type_Slot_Set(value1, i - 1);
	}
}

function UrlToNum(value) {
	if (value == "a") return 0;
	if (value == "b") return 1;
	if (value == "c") return 2;
	if (value == "d") return 3;
	if (value == "e") return 4;
	if (value == "f") return 5;
	if (value == "g") return 6;
	if (value == "h") return 7;
	if (value == "i") return 8;
	if (value == "j") return 9;
	if (value == "k") return 10;
	if (value == "l") return 11;
	if (value == "m") return 12;
	if (value == "n") return 13;
	if (value == "o") return 14;
	if (value == "p") return 15;
	if (value == "q") return 16;
	if (value == "r") return 17;
	if (value == "s") return 18;
	if (value == "t") return 19;
	if (value == "u") return 20;
	if (value == "v") return 21;
	if (value == "w") return 22;
	if (value == "x") return 23;
	if (value == "y") return 24;
	if (value == "z") return 25;
	if (value == "A") return 26;
	if (value == "B") return 27;
	if (value == "C") return 28;
	if (value == "D") return 29;
	if (value == "E") return 30;
	if (value == "F") return 31;
	if (value == "G") return 32;
	if (value == "H") return 33;
	if (value == "I") return 34;
	if (value == "J") return 35;
	if (value == "K") return 36;
	if (value == "L") return 37;
	if (value == "M") return 38;
	if (value == "N") return 39;
	if (value == "O") return 40;
	if (value == "P") return 41;
	if (value == "Q") return 42;
	if (value == "R") return 43;
	if (value == "S") return 44;
	if (value == "T") return 45;
	if (value == "U") return 46;
	if (value == "V") return 47;
	if (value == "W") return 48;
	if (value == "X") return 49;
	if (value == "Y") return 50;
	if (value == "Z") return 51;
	if (value == "1") return 52;
	if (value == "2") return 53;
	if (value == "3") return 54;
	if (value == "4") return 55;
	if (value == "5") return 56;
	if (value == "6") return 57;
	if (value == "7") return 58;
	if (value == "8") return 59;
	if (value == "9") return 60;
	if (value == "0a") return 61;
	if (value == "0b") return 62;
	if (value == "0c") return 63;
	if (value == "0d") return 64;
	if (value == "0e") return 65;
	if (value == "0f") return 66;
	if (value == "0g") return 67;
	if (value == "0h") return 68;
	if (value == "0i") return 69;
	if (value == "0j") return 70;
    return 0;
}

function NumToUrl(value) {
	if (value == 0) return "a";
	if (value == 1) return "b";
	if (value == 2) return "c";
	if (value == 3) return "d";
	if (value == 4) return "e";
	if (value == 5) return "f";
	if (value == 6) return "g";
	if (value == 7) return "h";
	if (value == 8) return "i";
	if (value == 9) return "j";
	if (value == 10) return "k";
	if (value == 11) return "l";
	if (value == 12) return "m";
	if (value == 13) return "n";
	if (value == 14) return "o";
	if (value == 15) return "p";
	if (value == 16) return "q";
	if (value == 17) return "r";
	if (value == 18) return "s";
	if (value == 19) return "t";
	if (value == 20) return "u";
	if (value == 21) return "v";
	if (value == 22) return "w";
	if (value == 23) return "x";
	if (value == 24) return "y";
	if (value == 25) return "z";
	if (value == 26) return "A";
	if (value == 27) return "B";
	if (value == 28) return "C";
	if (value == 29) return "D";
	if (value == 30) return "E";
	if (value == 31) return "F";
	if (value == 32) return "G";
	if (value == 33) return "H";
	if (value == 34) return "I";
	if (value == 35) return "J";
	if (value == 36) return "K";
	if (value == 37) return "L";
	if (value == 38) return "M";
	if (value == 39) return "N";
	if (value == 40) return "O";
	if (value == 41) return "P";
	if (value == 42) return "Q";
	if (value == 43) return "R";
	if (value == 44) return "S";
	if (value == 45) return "T";
	if (value == 46) return "U";
	if (value == 47) return "V";
	if (value == 48) return "W";
	if (value == 49) return "X";
	if (value == 50) return "Y";
	if (value == 51) return "Z";
	if (value == 52) return "1";
	if (value == 53) return "2";
	if (value == 54) return "3";
	if (value == 55) return "4";
	if (value == 56) return "5";
	if (value == 57) return "6";
	if (value == 58) return "7";
	if (value == 59) return "8";
	if (value == 60) return "9";
	if (value == 61) return "0a";
	if (value == 62) return "0b";
	if (value == 63) return "0c";
	if (value == 64) return "0d";
	if (value == 65) return "0e";
	if (value == 66) return "0f";
	if (value == 67) return "0g";
	if (value == 68) return "0h";
	if (value == 69) return "0i";
	if (value == 70) return "0j";
	return "a";
}

