//0:ギヤ, 1:モーター, 2:ボディ, 3:シャーシ, 4:フロント・ホイール, 5:リヤ・ホイール, 6:フロント・タイヤ, 7:リヤ・タイヤ, 8:フロントステー, 9:サイドステー, 10:リヤステー, 11:フロント中・ローラー, 12:サイド中・ローラー, 13:リヤ中・ローラー, 14:フロント上・ローラー, 15:サイド上・ローラー, 16:リヤ上・ローラー, 17:リヤ下・ローラー, 18:ウイング・ローラー, 19:ボディオプション, 20:フロント・スタビライザー, 21:サイド・スタビライザー, 22:リヤ・スタビライザー, 23:フロント・ウェイト, 24:リヤ・ウェイト, 25:アクセサリー・ターミナル, 26:アクセサリー・モーターサポート, 27:アクセサリー・ピニオンギヤ, 28:アクセサリー・プロペラシャフト, 29:アクセサリー・軸受け, 30:アクセサリー・シャフト, 31:アクセサリー・クラウンギヤ, 32:アクセサリー・ギヤシャフト, 33:バッテリー
var nameValue = new Array("moter", "gear", "body", "chassis", "f_wheel", "r_wheel", "f_tire", "r_tire", "f_stator", "s_stator", "r_stator", "fm_roller", "sm_roller", "rm_roller", "ft_roller", "st_roller", "rt_roller", "rb_roller", "w_roller", "bodyoption", "f_stabilizer", "s_stabilizer", "r_stabilizer", "f_weight", "r_weight", "terminal", "msupport", "pgear", "pshaft", "bearing", "shaft", "cgear", "gshaft", "battery");
var nameView = new Array("モーター ", "ギヤ ", "ボディ ", "シャーシ ", "フロント・ホイール ", "リヤ・ホイール ", "フロント・タイヤ ", "リヤ・タイヤ ", "フロントステー ", "サイドステー ", "リヤステー ", "フロント中・ローラー ", "サイド中・ローラー ", "リヤ中・ローラー ", "フロント上・ローラー ", "サイド上・ローラー ", "リヤ上・ローラー ", "リヤ下・ローラー ", "ウイング・ローラー ", "ボディオプション ", "フロント・スタビライザー ", "サイド・スタビライザー ", "リヤ・スタビライザー ", "フロント・ウェイト ", "リヤ・ウェイト ", "アクセサリー・ターミナル ", "アクセサリー・モーターサポート ", "アクセサリー・ピニオンギヤ ", "アクセサリー・プロペラシャフト ", "アクセサリー・軸受け ", "アクセサリー・シャフト ", "アクセサリー・クラウンギヤ ", "アクセサリー・ギヤシャフト ", "バッテリー ");
//0:ギヤ, 1:モーター, 2:ボディ, 3:シャーシ, 4:ホイール, 5:タイヤ, 6:フロントステー, 7:サイドステー, 8:リヤステー, 9:ローラー, 10:ボディオプション, 11:スタビライザー, 12:ウェイト, 13:ターミナル, 14:モーターサポート, 15:ピニオンギヤ, 16:プロペラシャフト, 17:軸受け, 18:シャフト, 19:クラウンギヤ, 20:ギヤシャフト, 21:バッテリー
var nameCalc = new Array(0, 1, 2, 3, 4, 4, 5, 5, 6, 7, 8, 9, 9, 9, 9, 9, 9, 9, 9, 10, 11, 11, 11, 12, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21);

var typeValue = new Array("", "speed", "power", "corner", "stamina", "weight", "gearfuka", "powerloss", "speedloss", "aerodf", "setsuden", "seishin", "thrust", "tiremasatsu", "tiresenkai", "tirehanpatsu", "tirekei", "rollermasatsu", "rollerteikou", "wave", "offload", "gearrate", "ampere", "brake", "stabilizer");
var typeView = new Array("", "スピード ", "パワー ", "コーナー安定 ", "スタミナ耐久 ", "重さ ", "ギヤ負荷 ", "パワーロス ", "スピードロス ", "ｴｱﾛﾀﾞｳﾝﾌｫｰｽ ", "節電 ", "制振 ", "スラスト角 ", "タイヤ摩擦 ", "タイヤ旋回 ", "タイヤ反発 ", "タイヤ径 ", "ローラー摩擦 ", "ローラー抵抗 ", "ウェーブ ", "オフロード ", "ギヤ比 ", "消費電流 ", "ブレーキ減速 ", "スタビ減速 ");

var nameUpdate = new Array(1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);

//タイプ 1:スピード, 2:パワー, 3:コーナー安定, 4:スタミナ耐久, 5:重さ, 6:ギヤ負荷, 7:パワーロス, 8:スピードロス, 9:エアロダウンフォース, 10:節電
//11:制振, 12:スラスト角, 13:タイヤ摩擦, 14:タイヤ旋回, 15:タイヤ反発, 16:タイヤ径, 17:ローラー摩擦, 18:ローラー抵抗, 19:ウェーブ, 20:オフロード
//21:ギヤ比, 22:消費電流, 23:ブレーキ減速, 24:スタビ減速
var s;
var typeSelect = new Array();
typeSelect[0] = new Array(1, 2, 3, 4, 5, 6, 22);
typeSelect[1] = new Array(1, 2, 3, 4, 5, 6, 7, 21);
typeSelect[2] = new Array(1, 2, 3, 4, 5, 9, 10);
typeSelect[3] = new Array(1, 2, 3, 4, 5, 6, 11, 12);
typeSelect[4] = new Array(1, 2, 3, 4, 5, 7, 8, 11, 19);
typeSelect[5] = new Array(1, 2, 3, 4, 5, 7, 8, 13, 14, 15, 16, 20);
typeSelect[6] = new Array(1, 2, 3, 4, 5, 9, 12);
typeSelect[7] = new Array(1, 2, 3, 4, 5, 9);
typeSelect[8] = new Array(1, 2, 3, 4, 5, 9, 23);
typeSelect[9] = new Array(1, 2, 3, 4, 5, 17, 18);
typeSelect[10] = new Array(1, 2, 3, 4, 5, 9);
typeSelect[11] = new Array(1, 2, 3, 4, 5, 24);
typeSelect[12] = new Array(1, 2, 3, 4, 5);
typeSelect[13] = new Array(1, 2, 3, 4, 5, 7, 10);
typeSelect[14] = new Array(1, 2, 3, 4, 5, 10);
typeSelect[15] = new Array(1, 2, 3, 4, 5, 6, 7);
typeSelect[16] = new Array(1, 2, 3, 4, 5, 6, 7);
typeSelect[17] = new Array(1, 2, 3, 4, 5, 8);
typeSelect[18] = new Array(1, 2, 3, 4, 5, 8);
typeSelect[19] = new Array(1, 2, 3, 4, 5, 6, 7);
typeSelect[20] = new Array(1, 2, 3, 4, 5, 8);
typeSelect[21] = new Array(1, 2, 3, 4, 5);

var kaizouSelect = new Array();
s = 0;
kaizouSelect[0] = new Array();
kaizouSelect[0][s++] = new Array(0, 1, 4, 5, 6, 9);
kaizouSelect[0][s++] = new Array(0, 1, 4, 5, 6, 9);
kaizouSelect[0][s++] = new Array(0, 1, 2, 4, 5, 7, 10 ,11);
kaizouSelect[0][s++] = new Array(0, 1, 3, 4, 6, 8, 10 ,11);
kaizouSelect[0][s++] = new Array(0, 1, 4, 5, 6, 9);
s = 0;
kaizouSelect[1] = new Array();
kaizouSelect[1][s++] = new Array(0, 1, 2, 3, 4);
s = 0;
kaizouSelect[2] = new Array();
kaizouSelect[2][s++] = new Array(0, 1, 2, 3, 4);
s = 0;
kaizouSelect[3] = new Array();
kaizouSelect[3][s++] = new Array(0, 1, 2, 3, 4, 5, 6 ,7);
s = 0;
kaizouSelect[4] = new Array();
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5, 6);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5, 6);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5, 6);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5, 6);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5, 6);
kaizouSelect[4][s++] = new Array(0, 1, 2, 3, 4, 5, 6);
s = 0;
kaizouSelect[5] = new Array();
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 4, 5);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 6);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 6);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 6);
kaizouSelect[5][s++] = new Array(0, 1, 2, 3, 6);
s = 0;
kaizouSelect[6] = new Array();
kaizouSelect[6][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[6][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[6][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[6][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[6][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[6][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[6][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[6][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[6][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[6][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[6][s++] = new Array(0, 1, 3, 4, 5);
s = 0;
kaizouSelect[7] = new Array();
kaizouSelect[7][s++] = new Array(0, 1, 2, 3);
s = 0;
kaizouSelect[8] = new Array();
kaizouSelect[8][s++] = new Array(0, 1, 2, 3);
kaizouSelect[8][s++] = new Array(0, 3);
kaizouSelect[8][s++] = new Array(0, 3);
kaizouSelect[8][s++] = new Array(0, 1, 2, 3);
kaizouSelect[8][s++] = new Array(0, 1, 2, 3);
s = 0;
kaizouSelect[9] = new Array();
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3, 4);
kaizouSelect[9][s++] = new Array(0, 1, 2, 3);
s = 0;
kaizouSelect[10] = new Array();
kaizouSelect[10][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelect[11] = new Array();
kaizouSelect[11][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelect[12] = new Array();
kaizouSelect[12][s++] = new Array();
s = 0;
kaizouSelect[13] = new Array();
kaizouSelect[13][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelect[14] = new Array();
kaizouSelect[14][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelect[15] = new Array();
kaizouSelect[15][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelect[16] = new Array();
kaizouSelect[16][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelect[17] = new Array();
kaizouSelect[17][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelect[18] = new Array();
kaizouSelect[18][s++] = new Array(0, 1, 2);
s = 0;
kaizouSelect[19] = new Array();
kaizouSelect[19][s++] = new Array();
s = 0;
kaizouSelect[20] = new Array();
kaizouSelect[20][s++] = new Array();
s = 0;
kaizouSelect[21] = new Array();
kaizouSelect[21][s++] = new Array();

var selectValue = new Array();
s = 0;
selectValue[0] = new Array();
selectValue[0][s++] = new Array("FA-130タイプノーマル", 1380.0, 495.0, 0.0, 0.0, 17.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1100.0);
selectValue[0][s++] = new Array("ハイパーミニ", 1460.0, 730.0, 0.0, 0.0, 17.0, 1500.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1500.0);
selectValue[0][s++] = new Array("トルクチューン", 1430.0, 1268.0, 0.0, 0.0, 17.0, 1500.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1700.0);
selectValue[0][s++] = new Array("レブチューン", 1740.0, 747.0, 0.0, 0.0, 17.0, 1500.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 2000.0);
selectValue[0][s++] = new Array("ハイパーダッシュ", 1900.0, 1583.0, 0.0, 0.0, 17.0, 1500.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1600.0);
s = 0;
selectValue[1] = new Array();
selectValue[1][s++] = new Array("5:1 標準ギヤ", 0.0, 20.0, 0.0, 0.2, 1.0, 1000.0, 400.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 5.0);
selectValue[1][s++] = new Array("4.2:1 高速ギヤ", 5.0, 15.0, 0.0, 0.2, 1.0, 1000.0, 400.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 4.2);
selectValue[1][s++] = new Array("4:1 ハイスピードギヤ", 10.0, 10.0, 0.0, 0.2, 1.0, 1000.0, 400.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 4.0);
selectValue[1][s++] = new Array("4:1 スーパーカウンターギヤ", 10.0, 10.0, 0.0, 0.4, 1.5, 900.0, 350.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 4.0);
selectValue[1][s++] = new Array("3.5:1 超速ギヤ", 20.0, 0.0, 0.0, 0.4, 1.5, 850.0, 350.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3.5);
s = 0;
selectValue[2] = new Array();
selectValue[2][s++] = new Array("パックマンボディ", 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("スーパードラゴンSDP", 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ホーネットJr.(棚橋SP)", 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ブーメラン・10", 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("アバンテJr.", 7.0, 4.0, 10.5, 5.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("セイントドラゴンJr.", 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("マグナムセイバー", 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ソニックセイバー", 7.0, 4.0, 10.5, 5.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("スピンアックス", 7.0, 4.0, 10.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("トライダガーX", 20.0, 0.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ビークスパイダー", 7.0, 4.0, 10.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ブラックセイバー", 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ブロッケンギガント", 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("プロトセイバーJB", 2.0, 2.0, 18.0, 20.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("シャイニングスコーピオン", 20.0, 0.0, 1.2, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("ビクトリーマグナム", 20.0, 1.0, 4.5, 0.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
selectValue[2][s++] = new Array("バンガードソニック", 7.0, 5.0, 10.5, 5.0, 16.0, 0.0, 0.0, 0.0, 50.0, 0.0);
s = 0;
selectValue[3] = new Array();
selectValue[3][s++] = new Array("スーパー1シャーシ", 10.0, 10.0, 9.12, 10.8, 15.8, 800.0, 0.0, 0.0, 0.0, 0.0, 100.0, 8.0);
selectValue[3][s++] = new Array("スーパー1強化シャーシ", 11.0, 10.0, 9.6, 25.0, 15.8, 800.0, 0.0, 0.0, 0.0, 0.0, 100.0, 8.0);
selectValue[3][s++] = new Array("ゼロシャーシ", 15.0, 5.0, 8.76, 13.5, 15.1, 850.0, 0.0, 0.0, 0.0, 0.0, 100.0, 5.0);
selectValue[3][s++] = new Array("タイプ1シャーシ", 2.0, 18.0, 8.4, 18.0, 18.8, 1000.0, 0.0, 0.0, 0.0, 0.0, 100.0, 1.0);
selectValue[3][s++] = new Array("タイプ1シャーシ(イベント)", 2.0, 18.0, 7.92, 18.0, 18.8, 1000.0, 0.0, 0.0, 0.0, 0.0, 100.0, 1.0);
selectValue[3][s++] = new Array("タイプ2シャーシ", 20.0, 0.0, 8.16, 14.4, 17.7, 950.0, 0.0, 0.0, 0.0, 0.0, 100.0, 1.0);
selectValue[3][s++] = new Array("タイプ3シャーシ", 4.0, 16.0, 7.68, 16.2, 18.6, 930.0, 0.0, 0.0, 0.0, 0.0, 100.0, 1.0);
selectValue[3][s++] = new Array("FMシャーシ", 9.0, 11.0, 8.52, 12.6, 18.0, 900.0, 0.0, 0.0, 0.0, 0.0, 100.0, 5.0);
selectValue[3][s++] = new Array("スーパーFMシャーシ", 12.0, 8.0, 9.12, 13.8, 17.8, 800.0, 0.0, 0.0, 0.0, 0.0, 100.0, 8.0);
s = 0;
selectValue[4] = new Array();
selectValue[4][s++] = new Array("小径タイプ1・フロント", 0.0, 12.0, 1.0, 2.0, 1.7, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径タイプ1・リヤ", 0.0, 12.0, 1.0, 2.0, 2.3, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径ナローワンウェイ・フロント", 8.0, 5.0, 4.0, 2.6, 3.0, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[4][s++] = new Array("小径ナローワンウェイ・リヤ", 8.0, 5.0, 4.0, 2.6, 4.5, 0.0, 80.0, 1000.0, 0.0, 0.0, 50.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[4][s++] = new Array("小径ローハイトワイド・フロント", 5.0, 8.0, 2.0, 2.8, 1.7, 0.0, 160.0, 1000.0, 0.0, 0.0, 100.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径ローハイトワイド・リヤ", 5.0, 8.0, 2.0, 2.8, 2.3, 0.0, 160.0, 1000.0, 0.0, 0.0, 100.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("小径ローハイトWワンウェイ・フロント", 6.0, 7.0, 6.0, 3.0, 3.0, 0.0, 80.0, 1000.0, 0.0, 0.0, 100.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[4][s++] = new Array("小径ローハイトWワンウェイ・リヤ", 6.0, 7.0, 6.0, 3.0, 4.5, 0.0, 80.0, 1000.0, 0.0, 0.0, 100.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[4][s++] = new Array("大径タイプ1・フロント", 12.0, 0.0, 1.0, 2.0, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ1・リヤ", 12.0, 0.0, 1.0, 2.0, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ2・フロント", 12.0, 0.0, 1.0, 2.4, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ2・リヤ", 12.0, 0.0, 1.0, 2.4, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ3・フロント", 12.0, 0.0, 1.0, 2.6, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ3・リヤ", 12.0, 0.0, 1.0, 2.6, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ4・フロント", 12.0, 0.0, 1.0, 2.0, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ4・リヤ", 12.0, 0.0, 1.0, 2.0, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ7・フロント", 11.0, 3.0, 1.0, 2.0, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径タイプ7・リヤ", 11.0, 3.0, 1.0, 2.0, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径エアロホイール・フロント", 12.0, 1.0, 1.0, 2.4, 1.7, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径エアロホイール・リヤ", 12.0, 1.0, 1.0, 2.4, 2.3, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径スピード・フロント", 13.0, 0.0, 1.0, 2.4, 1.6, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径スピード・リヤ", 13.0, 0.0, 1.0, 2.4, 2.2, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径ライトウェイト・フロント", 11.0, 2.0, 1.0, 2.0, 1.5, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径ライトウェイト・リヤ", 11.0, 2.0, 1.0, 2.0, 2.0, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径ワイド・フロント", 11.0, 2.0, 2.0, 2.9, 2.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径ワイド・リヤ", 11.0, 2.0, 2.0, 2.9, 3.8, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[4][s++] = new Array("大径ワンウェイ・フロント", 10.0, 3.0, 4.0, 2.6, 3.0, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
selectValue[4][s++] = new Array("大径ワンウェイ・リヤ", 10.0, 3.0, 4.0, 2.6, 4.5, 0.0, 320.0, 1000.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3500.0);
s = 0;
selectValue[5] = new Array();
selectValue[5][s++] = new Array("小径ノーマル・フロント", 0.0, 10.0, 1.8, 2.4, 5.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 90.0, 26.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径ノーマル・リヤ", 0.0, 10.0, 1.8, 2.4, 7.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 90.0, 26.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径スリック・フロント", 2.0, 10.0, 2.0, 2.2, 4.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 85.0, 26.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径スリック・リヤ", 2.0, 10.0, 2.0, 2.2, 7.7, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 85.0, 26.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径スリック・フロント(赤)", 2.0, 10.0, 2.0, 2.4, 5.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 85.0, 26.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径スリック・リヤ(赤)", 2.0, 10.0, 2.0, 2.4, 7.5, 0.0, 130.0, 910.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 85.0, 26.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径スポンジ・フロント", 2.0, 11.0, 3.6, 2.0, 3.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 76.0, 73.0, 65.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径スポンジ・リヤ", 2.0, 11.0, 3.6, 2.0, 4.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 76.0, 73.0, 65.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径レストンスポンジ・フロント(青)", 3.0, 10.0, 4.8, 2.0, 2.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 80.0, 78.0, 60.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径レストンスポンジ・リヤ(青)", 3.0, 10.0, 4.8, 2.0, 3.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 80.0, 78.0, 60.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径レストンスポンジ・フロント(橙)", 3.0, 10.0, 4.8, 2.0, 3.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 80.0, 78.0, 60.0, 24.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("小径レストンスポンジ・リヤ(橙)", 3.0, 10.0, 4.8, 2.0, 4.5, 0.0, 120.0, 840.0, 0.0, 0.0, 0.0, 0.0, 80.0, 78.0, 60.0, 24.0, 0.0, 0.0, 0.0, 0.0);

selectValue[5][s++] = new Array("大径ノーマル・フロント", 10.0, 0.0, 1.8, 2.4, 5.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 130.0, 31.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径ノーマル・リヤ", 10.0, 0.0, 1.8, 2.4, 7.8, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 130.0, 31.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スリック・フロント", 12.0, 0.0, 2.0, 2.2, 5.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 130.0, 31.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スリック・リヤ", 12.0, 0.0, 2.0, 2.2, 7.8, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 130.0, 31.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スリック・フロント(赤)", 12.0, 0.0, 2.0, 2.4, 5.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 130.0, 31.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スリック・リヤ(赤)", 12.0, 0.0, 2.0, 2.4, 7.8, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 62.0, 55.0, 130.0, 31.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スポンジ・フロント", 12.0, 1.0, 3.6, 2.0, 3.5, 0.0, 150.0, 1050.0, 0.0, 0.0, 0.0, 0.0, 76.0, 73.0, 120.0, 30.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スポンジ・リヤ", 12.0, 1.0, 3.6, 2.0, 4.5, 0.0, 150.0, 1050.0, 0.0, 0.0, 0.0, 0.0, 76.0, 73.0, 120.0, 30.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径ワイドスポンジ・フロント", 11.0, 2.0, 10.0, 4.0, 4.5, 0.0, 150.0, 1050.0, 0.0, 0.0, 0.0, 0.0, 80.0, 84.0, 110.0, 30.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径ワイドスポンジ・リヤ", 11.0, 2.0, 10.0, 4.0, 5.5, 0.0, 150.0, 1050.0, 0.0, 0.0, 0.0, 0.0, 80.0, 84.0, 110.0, 30.0, 0.0, 0.0, 0.0, 0.0);
selectValue[5][s++] = new Array("大径スパイク・フロント", 12.0, 0.0, 1.8, 2.8, 5.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 56.0, 67.0, 138.0, 31.0, 0.0, 0.0, 0.0, 2000.0);
selectValue[5][s++] = new Array("大径スパイク・リヤ", 12.0, 0.0, 1.8, 2.8, 7.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 56.0, 67.0, 138.0, 31.0, 0.0, 0.0, 0.0, 2000.0);
selectValue[5][s++] = new Array("大径スパイク・フロント(赤)", 12.0, 0.0, 1.8, 2.8, 5.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 76.0, 67.0, 138.0, 31.0, 0.0, 0.0, 0.0, 2000.0);
selectValue[5][s++] = new Array("大径スパイク・リヤ(赤)", 12.0, 0.0, 1.8, 2.8, 7.5, 0.0, 155.0, 1085.0, 0.0, 0.0, 0.0, 0.0, 76.0, 67.0, 138.0, 31.0, 0.0, 0.0, 0.0, 2000.0);
s = 0;
selectValue[6] = new Array();
selectValue[6][s++] = new Array("なし", 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[6][s++] = new Array("エアロハイマウント フロントステー", 0.0, 0.0, 26.4, 30.0, 4.0, 0.0, 0.0, 0.0, 30.0, 0.0, 0.0, 3.0);
selectValue[6][s++] = new Array("ハイマウント フロントステー", 0.0, 0.0, 26.4, 30.5, 4.0, 0.0, 0.0, 0.0, 20.0, 0.0, 0.0, 2.0);
selectValue[6][s++] = new Array("フロント強化ガード", 0.0, 0.0, 28.8, 32.5, 3.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 2.0);
selectValue[6][s++] = new Array("ターボフロントステー", 0.0, 0.0, 24.0, 25.0, 3.0, 0.0, 0.0, 0.0, 10.0, 0.0, 0.0, 1.0);
selectValue[6][s++] = new Array("FRP補強プレート・フロント", 0.0, 0.0, 36.0, 49.0, 4.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 2.0);
selectValue[6][s++] = new Array("FRP強化マウント・フロント", 0.0, 0.0, 38.4, 55.0, 4.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 2.5);
selectValue[6][s++] = new Array("スペーサー付き補強FRP・フロント", 0.0, 0.0, 36.0, 45.0, 6.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 2.0);
selectValue[6][s++] = new Array("ダウンスラストフロントステー", 0.0, 0.0, 32.4, 40.5, 5.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 4.0);
selectValue[6][s++] = new Array("可変ダウンスラストローラーステー", 0.0, 0.0, 31.2, 39.0, 6.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 5.0);
selectValue[6][s++] = new Array("フロントスライドダンパー", 0.0, 0.0, 33.6, 42.0, 5.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 3.0);
s = 0;
selectValue[7] = new Array();
selectValue[7][s++] = new Array("なし", 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[7][s++] = new Array("サイドガード", 0.0, 0.0, 12.0, 5.0, 2.0, 0.0, 0.0, 0.0, 1.0);
selectValue[7][s++] = new Array("ポール付きFRPショート・サイド", 0.0, 0.0, 38.4, 27.5, 6.0, 0.0, 0.0, 0.0, 1.0);
selectValue[7][s++] = new Array("サイドポール", 0.0, 0.0, 12.0, 15.0, 6.0, 0.0, 0.0, 0.0, 1.0);
s = 0;
selectValue[8] = new Array();
selectValue[8][s++] = new Array("なし", 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[8][s++] = new Array("アルミリヤーマルチステー", 0.0, 0.0, 36.0, 50.0, 6.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[8][s++] = new Array("ダブルアルミリヤステー", 0.0, 0.0, 39.6, 60.0, 6.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[8][s++] = new Array("リヤースキッド", 0.0, 0.0, 31.8, 34.5, 4.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 40.0);
selectValue[8][s++] = new Array("リヤローラー・スタビステー", 0.0, 0.0, 31.2, 27.5, 6.0, 0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 50.0);
s = 0;
selectValue[9] = new Array();
selectValue[9][s++] = new Array("なし", 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[9][s++] = new Array("ローラー用9mmボールベアリング", 0.0, 0.0, 68.4, 16.25, 2.9, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 15.0, 100.0);
selectValue[9][s++] = new Array("10mm標準プラ1", 0.0, 0.0, 24.0, 2.5, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 300.0);
selectValue[9][s++] = new Array("12mmセットアップローラーズ", 0.0, 0.0, 37.5, 3.0, 1.2, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 250.0);
selectValue[9][s++] = new Array("12mm標準プラ1", 0.0, 0.0, 36.0, 2.5, 1.2, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 300.0);
selectValue[9][s++] = new Array("12mmゴム付きプラ", 0.0, 0.0, 79.2, 3.0, 1.3, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 300.0);
selectValue[9][s++] = new Array("ローラー用13mmボールベアリング", 0.0, 0.0, 82.8, 16.25, 3.3, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 15.0, 100.0);
selectValue[9][s++] = new Array("13mmセットアップローラーズ", 0.0, 0.0, 40.5, 3.0, 1.3, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 250.0);
selectValue[9][s++] = new Array("14mmセットアップローラーズ", 0.0, 0.0, 46.8, 3.0, 1.4, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 250.0);
selectValue[9][s++] = new Array("14mm標準プラ1", 0.0, 0.0, 43.2, 2.5, 1.4, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 300.0);
selectValue[9][s++] = new Array("14mmプラベアリング", 0.0, 0.0, 50.4, 2.5, 1.4, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 150.0);
selectValue[9][s++] = new Array("14mm標準ゴム1", 0.0, 0.0, 86.4, 3.5, 1.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 300.0);
selectValue[9][s++] = new Array("14mmゴム付きプラベアリング", 0.0, 0.0, 86.4, 3.0, 1.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 150.0);
selectValue[9][s++] = new Array("15mmセットアップローラーズ", 0.0, 0.0, 50.4, 3.0, 1.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 250.0);
selectValue[9][s++] = new Array("15mmゴム付きプラ", 0.0, 0.0, 90.0, 3.5, 1.6, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 300.0);
selectValue[9][s++] = new Array("16mmセットアップローラーズ", 0.0, 0.0, 54.0, 3.0, 1.6, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 250.0);
selectValue[9][s++] = new Array("16mm標準プラ1", 0.0, 0.0, 50.4, 2.5, 1.6, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 8.0, 300.0);
selectValue[9][s++] = new Array("16mmゴム付きプラ", 0.0, 0.0, 93.6, 3.5, 1.7, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 300.0);
selectValue[9][s++] = new Array("19mmゴム付きプラ", 0.0, 0.0, 104.4, 3.0, 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 300.0);
selectValue[9][s++] = new Array("19mmゴム付きアルミベアリング", 0.0, 0.0, 104.4, 12.5, 4.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 20.0, 100.0);
s = 0;
selectValue[10] = new Array();
selectValue[10][s++] = new Array("なし", 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[10][s++] = new Array("ターボリヤウイング", 0.0, 0.0, 300.0, 1.2, 2.0, 0.0, 0.0, 0.0, 150.0);
selectValue[10][s++] = new Array("エアロハイマウント リヤウイング", 0.0, 0.0, 280.0, 3.6, 4.0, 0.0, 0.0, 0.0, 100.0);
selectValue[10][s++] = new Array("ハイマウント リヤウイング", 0.0, 0.0, 240.0, 2.4, 3.0, 0.0, 0.0, 0.0, 80.0);
selectValue[10][s++] = new Array("スライドダンパー", 0.0, 0.0, 200.0, 4.8, 5.0, 0.0, 0.0, 0.0, 60.0);
s = 0;
selectValue[11] = new Array();
selectValue[11][s++] = new Array("なし", 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[11][s++] = new Array("スタビライザーポール", 0.0, 0.0, 45.0, 2.5, 3.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 10.0);
s = 0;
selectValue[12] = new Array();
selectValue[12][s++] = new Array("なし", 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[12][s++] = new Array("セッティングウェイト2g", 0.0, 0.0, 0.0, 0.0, 2.0);
selectValue[12][s++] = new Array("セッティングウェイト4g", 0.0, 0.0, 0.0, 0.0, 4.0);
selectValue[12][s++] = new Array("セッティングウェイト6g", 0.0, 0.0, 0.0, 0.0, 6.0);
selectValue[12][s++] = new Array("セッティングウェイト8g", 0.0, 0.0, 0.0, 0.0, 8.0);
s = 0;
selectValue[13] = new Array();
selectValue[13][s++] = new Array("標準ターミナル", 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[13][s++] = new Array("ゴールドターミナル", 28.0, 2.0, 0.0, 1.0, 1.0, 0.0, 48.0, 0.0, 0.0, 1200.0);
s = 0;
selectValue[14] = new Array();
selectValue[14][s++] = new Array("なし", 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
selectValue[14][s++] = new Array("放熱フィン", 7.0, 23.0, 0.0, 1.0, 1.5, 0.0, 0.0, 0.0, 0.0, 1000.0);
s = 0;
selectValue[15] = new Array();
selectValue[15][s++] = new Array("標準ピニオンギヤ", 0.0, 0.0, 0.0, 0.0, 0.1, 700.0, 400.0);
selectValue[15][s++] = new Array("ピニオンギヤ(紫)", 10.0, 10.0, 0.0, 0.2, 0.1, 650.0, 380.0);
selectValue[15][s++] = new Array("真ちゅうピニオンギヤ", 4.0, 16.0, 0.0, 1.0, 0.4, 650.0, 380.0);
s = 0;
selectValue[16] = new Array();
selectValue[16][s++] = new Array("標準プロペラシャフト", 0.0, 0.0, 0.0, 0.0, 2.0, 700.0, 300.0);
selectValue[16][s++] = new Array("中空軽量プロペラシャフト", 16.0, 14.0, 0.0, 0.2, 1.0, 650.0, 280.0);
s = 0;
selectValue[17] = new Array();
selectValue[17][s++] = new Array("標準軸受け", 0.0, 0.0, 0.0, 0.0, 2.0, 0.0, 0.0, 1200.0);
selectValue[17][s++] = new Array("メタル軸受け", 8.0, 22.0, 0.0, 1.0, 4.0, 0.0, 0.0, 950.0);
selectValue[17][s++] = new Array("ボールベアリング", 17.0, 13.0, 0.0, 2.0, 3.0, 0.0, 0.0, 900.0);
selectValue[17][s++] = new Array("丸穴ボールベアリング", 30.0, 0.0, 0.0, 2.0, 3.0, 0.0, 0.0, 850.0);
s = 0;
selectValue[18] = new Array();
selectValue[18][s++] = new Array("標準シャフト", 0.0, 0.0, 0.0, 0.0, 2.5, 0.0, 0.0, 1250.0);
selectValue[18][s++] = new Array("ハードシャフト", 5.0, 25.0, 0.0, 2.0, 3.0, 0.0, 0.0, 950.0);
selectValue[18][s++] = new Array("中空ステンレスシャフト", 25.0, 5.0, 0.0, 1.0, 2.0, 0.0, 0.0, 900.0);
s = 0;
selectValue[19] = new Array();
selectValue[19][s++] = new Array("標準クラウンギヤ", 0.0, 0.0, 0.0, 0.0, 0.8, 1400.0, 600.0);
s = 0;
selectValue[20] = new Array();
selectValue[20][s++] = new Array("標準ギヤシャフト", 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0);
s = 0;
selectValue[21] = new Array();
selectValue[21][s++] = new Array("標準バッテリー", 0.0, 0.0, 0.0, 0.0, 36.0);
selectValue[21][s++] = new Array("パワーチャンプゴールド", 0.0, 0.0, 0.0, 0.0, 36.0);

//2:イイ感じ, 3:職人技, 4:至高の逸品, 5:強化, 6:固定フラグ, 7:タイプ
var kaizouValue = new Array();
kaizouValue[0] = new Array();
kaizouValue[0][0] = new Array();
kaizouValue[0][0][0] = new Array("慣らし走行 [1]", "ギヤ負荷〇〇〇〇 [8] ", -0.08, -0.096, -0.112, -0.004, -1, 6);
kaizouValue[0][0][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[0][1] = new Array();
kaizouValue[0][1][0] = new Array("ピニオンギヤの固定", "ギヤ負荷〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 6);
kaizouValue[0][1][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[0][2] = new Array();
kaizouValue[0][2][0] = new Array("ブレークイン(トルク重視) ", "パワー〇〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 2);
kaizouValue[0][3] = new Array();
kaizouValue[0][3][0] = new Array("ブレークイン(回転数重視) ", "スピード〇〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 1);
kaizouValue[0][4] = new Array();
kaizouValue[0][4][0] = new Array("ブレークイン(バランス重視)", "スピード〇 [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 1);
kaizouValue[0][4][1] = new Array("", "パワー〇 [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 2);
kaizouValue[0][5] = new Array();
kaizouValue[0][5][0] = new Array("3Vブレークイン(トルク重視) [4]", "パワー〇〇〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 2);
kaizouValue[0][6] = new Array();
kaizouValue[0][6][0] = new Array("3Vブレークイン(回転数重視) [4]", "スピード〇〇〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 1);
kaizouValue[0][7] = new Array();
kaizouValue[0][7][0] = new Array("3Vブレークイン(バランス重視[トルク]) [2]", "スピード〇 [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 1);
kaizouValue[0][7][1] = new Array("", "パワー〇〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 2);
kaizouValue[0][8] = new Array();
kaizouValue[0][8][0] = new Array("3Vブレークイン(バランス重視[レブ]) [2]", "スピード〇〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 1);
kaizouValue[0][8][1] = new Array("", "パワー〇 [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 2);
kaizouValue[0][9] = new Array();
kaizouValue[0][9][0] = new Array("3Vブレークイン(バランス重視) [2]", "スピード〇〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 1);
kaizouValue[0][9][1] = new Array("", "パワー〇〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 2);
kaizouValue[0][10] = new Array();
kaizouValue[0][10][0] = new Array("冷却ブレークイン(トルク重視) [2]", "パワー〇〇〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 2);
kaizouValue[0][11] = new Array();
kaizouValue[0][11][0] = new Array("冷却ブレークイン(回転数重視) [2]", "スピード〇〇〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 1);

kaizouValue[1] = new Array();
kaizouValue[1][0] = new Array();
kaizouValue[1][0][0] = new Array("ギヤメンテ", "ギヤ負荷〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 6);
kaizouValue[1][0][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[1][1] = new Array();
kaizouValue[1][1][0] = new Array("ギヤ慣らし", "パワーロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 7);
kaizouValue[1][1][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[1][2] = new Array();
kaizouValue[1][2][0] = new Array("ギヤ研磨 [4]", "ギヤ負荷〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 6);
kaizouValue[1][2][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[1][3] = new Array();
kaizouValue[1][3][0] = new Array("ギヤフローティング加工 [2]", "ギヤ負荷〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 6);
kaizouValue[1][3][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[1][4] = new Array();
kaizouValue[1][4][0] = new Array("ギヤ位置の固定 [2]", "パワーロス〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 7);
kaizouValue[1][4][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);

kaizouValue[2] = new Array();
kaizouValue[2][0] = new Array();
kaizouValue[2][0][0] = new Array("軽量化", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[2][0][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[2][1] = new Array();
kaizouValue[2][1][0] = new Array("ｴｱﾛﾀﾞｳﾝﾌｫｰｽ増加 [4]", "ｴｱﾛﾀﾞｳﾝﾌｫｰｽ〇 [5] ", 0.05, 0.06, 0.07, 0.0025, -1, 9);
kaizouValue[2][1][1] = new Array("", "コーナー安定〇 [5(固定)] ", 1.0, 1.2, 1.4, 0.0025, 20, 3);
kaizouValue[2][2] = new Array();
kaizouValue[2][2][0] = new Array("ｴｱﾛﾀﾞｳﾝﾌｫｰｽ減少 [4]", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[2][2][1] = new Array("", "ｴｱﾛﾀﾞｳﾝﾌｫｰｽ× [5] ", -0.05, -0.06, -0.07, -0.0025, -1, 9);
kaizouValue[2][3] = new Array();
kaizouValue[2][3][0] = new Array("冷却能力向上 [4]", "節電〇 [5] ", 50, 60, 70, 0.0025, 1000, 10);
kaizouValue[2][3][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[2][4] = new Array();
kaizouValue[2][4][0] = new Array("限界軽量化 [2]", "重さ〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 5);
kaizouValue[2][4][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.0, 1.0, 0.0005, 100, 1);
kaizouValue[2][4][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);

kaizouValue[3] = new Array();
kaizouValue[3][0] = new Array();
kaizouValue[3][0][0] = new Array("グリスアップ", "ギヤ負荷〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 6);
kaizouValue[3][0][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[3][1] = new Array();
kaizouValue[3][1][0] = new Array("軽量化", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[3][1][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[3][2] = new Array();
kaizouValue[3][2][0] = new Array("限界軽量化 [2]", "重さ〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 5);
kaizouValue[3][2][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.0, 1.0, 0.0005, 100, 1);
kaizouValue[3][2][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);
kaizouValue[3][3] = new Array();
kaizouValue[3][3][0] = new Array("電池落とし", "コーナー安定〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 3);
kaizouValue[3][4] = new Array();
kaizouValue[3][4][0] = new Array("剛性補強 [4]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[3][4][1] = new Array("", "重さ× [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 5);
kaizouValue[3][5] = new Array();
kaizouValue[3][5][0] = new Array("ギヤ位置の調整 [2]", "ギヤ負荷〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 6);
kaizouValue[3][5][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[3][6] = new Array();
kaizouValue[3][6][0] = new Array("制振対策 [4]", "制振〇 [5] ", 0.05, 0.06, 0.07, 0.0025, -1, 11);
kaizouValue[3][6][1] = new Array("", "コーナー安定〇 [5(固定)] ", 1.0, 1.2, 1.4, 0.0025, 20, 3);
kaizouValue[3][7] = new Array();
kaizouValue[3][7][0] = new Array("超制振対策 [2]", "制振〇〇〇 [10] ", 0.1, 0.12, 0.14, 0.005, -1, 11);
kaizouValue[3][7][1] = new Array("", "コーナー安定〇 [10(固定)] ", 1.0, 1.0, 1.0, 0.005, 10, 3);
kaizouValue[3][7][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);

kaizouValue[4] = new Array();
kaizouValue[4][0] = new Array();
kaizouValue[4][0][0] = new Array("タイヤの固定", "パワーロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 7);
kaizouValue[4][0][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[4][1] = new Array();
kaizouValue[4][1][0] = new Array("シャフト受けの面取り", "スピードロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 8);
kaizouValue[4][1][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[4][2] = new Array();
kaizouValue[4][2][0] = new Array("軽量化 [4]", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[4][2][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[4][3] = new Array();
kaizouValue[4][3][0] = new Array("限界軽量化 [2]", "重さ〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 5);
kaizouValue[4][3][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.0, 1.0, 0.0005, 100, 1);
kaizouValue[4][3][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);
kaizouValue[4][4] = new Array();
kaizouValue[4][4][0] = new Array("ホイール貫通 [2]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[4][5] = new Array();
kaizouValue[4][5][0] = new Array("ホイールブレの精密調整 [4]", "コーナー安定〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 3);
kaizouValue[4][6] = new Array();
kaizouValue[4][6][0] = new Array("ギヤ精密調整 [4]", "パワーロス〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 7);
kaizouValue[4][6][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);

kaizouValue[5] = new Array();
kaizouValue[5][0] = new Array();
kaizouValue[5][0][0] = new Array("タイヤクリーニング", "パワーロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 7);
kaizouValue[5][0][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[5][1] = new Array();
kaizouValue[5][1][0] = new Array("タイヤウォーミングアップ [4]", "タイヤ摩擦〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 13);
kaizouValue[5][1][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[5][2] = new Array();
kaizouValue[5][2][0] = new Array("タイヤグリップ落とし [4]", "タイヤ旋回〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 14);
kaizouValue[5][2][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[5][3] = new Array();
kaizouValue[5][3][0] = new Array("タイヤ真円出し [4]", "スピードロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 8);
kaizouValue[5][3][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[5][4] = new Array();
kaizouValue[5][4][0] = new Array("トレッドパターン加工 [2]", "タイヤ摩擦〇〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 13);
kaizouValue[5][4][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[5][5] = new Array();
kaizouValue[5][5][0] = new Array("タイヤ面取り [2]", "タイヤ旋回〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 14);
kaizouValue[5][5][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[5][6] = new Array();
kaizouValue[5][6][0] = new Array("スパイク高さ調整 [2]", "オフロード〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 20);
kaizouValue[5][6][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);

kaizouValue[6] = new Array();
kaizouValue[6][0] = new Array();
kaizouValue[6][0][0] = new Array("ネジ締め調整", "スタミナ耐久〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 4);
kaizouValue[6][1] = new Array();
kaizouValue[6][1][0] = new Array("軽量化 [4]", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[6][1][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[6][2] = new Array();
kaizouValue[6][2][0] = new Array("限界軽量化 [2]", "重さ〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 5);
kaizouValue[6][2][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.0, 1.0, 0.0005, 100, 1);
kaizouValue[6][2][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);
kaizouValue[6][3] = new Array();
kaizouValue[6][3][0] = new Array("剛性補強 [4]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[6][3][1] = new Array("", "重さ× [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 5);
kaizouValue[6][4] = new Array();
kaizouValue[6][4][0] = new Array("スラスト角の増加 [4]", "スラスト角〇 [1] ",  0.01, 0.012, 0.014, 0.0005, -1, 12);
kaizouValue[6][4][1] = new Array("", "コーナー安定〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 3);
kaizouValue[6][5] = new Array();
kaizouValue[6][5][0] = new Array("スライドダンパーグリス調整 [4]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[6][5][1] = new Array("", "コーナー安定〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 3);

kaizouValue[7] = new Array();
kaizouValue[7][0] = new Array();
kaizouValue[7][0][0] = new Array("ネジ締め調整", "スタミナ耐久〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 4);
kaizouValue[7][1] = new Array();
kaizouValue[7][1][0] = new Array("軽量化 [4]", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[7][1][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[7][2] = new Array();
kaizouValue[7][2][0] = new Array("限界軽量化 [2]", "重さ〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 5);
kaizouValue[7][2][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.0, 1.0, 0.0005, 100, 1);
kaizouValue[7][2][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);
kaizouValue[7][3] = new Array();
kaizouValue[7][3][0] = new Array("剛性補強 [4]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[7][3][1] = new Array("", "重さ× [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 5);

kaizouValue[8] = new Array();
kaizouValue[8][0] = new Array();
kaizouValue[8][0][0] = new Array("ネジ締め調整", "スタミナ耐久〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 4);
kaizouValue[8][1] = new Array();
kaizouValue[8][1][0] = new Array("軽量化 [4]", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[8][1][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[8][2] = new Array();
kaizouValue[8][2][0] = new Array("限界軽量化 [2]", "重さ〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 5);
kaizouValue[8][2][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.0, 1.0, 0.0005, 100, 1);
kaizouValue[8][2][2] = new Array("", "スタミナ耐久× [1] ", -0.01, -0.012, -0.014, -0.0005, -1, 4);
kaizouValue[8][3] = new Array();
kaizouValue[8][3][0] = new Array("剛性補強 [4]", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);
kaizouValue[8][3][1] = new Array("", "重さ× [1] ", 0.01, 0.012, 0.014, 0.0005, -1, 5);

kaizouValue[9] = new Array();
kaizouValue[9][0] = new Array();
kaizouValue[9][0][0] = new Array("ローラーチェック", "ローラー摩擦〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 17);
kaizouValue[9][0][1] = new Array("", "コーナー安定〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 3);
kaizouValue[9][1] = new Array();
kaizouValue[9][1][0] = new Array("ローラー摩擦を強める [4]", "ローラー摩擦〇〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 17);
kaizouValue[9][1][1] = new Array("", "コーナー安定〇〇 [8] ", 0.08, 0.096, 0.112, 0.004, -1, 3);
kaizouValue[9][2] = new Array();
kaizouValue[9][2][0] = new Array("ローラー摩擦を弱める [4]", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[9][2][1] = new Array("", "ローラー摩擦×× [5]", -0.05, -0.06, -0.07, -0.0025, -1, 17);
kaizouValue[9][3] = new Array();
kaizouValue[9][3][0] = new Array("ローラー抵抗抜き [2]", "ローラー抵抗〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 18);
kaizouValue[9][3][1] = new Array("", "コーナー安定〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 3);
kaizouValue[9][4] = new Array();
kaizouValue[9][4][0] = new Array("ローラー軽量化 [4]", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);

kaizouValue[10] = new Array();
kaizouValue[10][0] = new Array();
kaizouValue[10][0][0] = new Array("軽量化", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[10][0][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[10][1] = new Array();
kaizouValue[10][1][0] = new Array("ｴｱﾛﾀﾞｳﾝﾌｫｰｽ増加 [4]", "ｴｱﾛﾀﾞｳﾝﾌｫｰｽ〇 [5] ", 0.05, 0.06, 0.07, 0.0025, -1, 9);
kaizouValue[10][1][1] = new Array("", "コーナー安定〇 [5(固定)] ", 1.0, 1.2, 1.4, 0.0025, 20, 3);
kaizouValue[10][2] = new Array();
kaizouValue[10][2][0] = new Array("ｴｱﾛﾀﾞｳﾝﾌｫｰｽ減少 [4]", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[10][2][1] = new Array("", "ｴｱﾛﾀﾞｳﾝﾌｫｰｽ× [5] ", -0.05, -0.06, -0.07, -0.0025, -1, 9);

kaizouValue[11] = new Array();
kaizouValue[11][0] = new Array();
kaizouValue[11][0][0] = new Array("スタビチェック", "スタビ減速〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 24);
kaizouValue[11][1] = new Array();
kaizouValue[11][1][0] = new Array("スタビ摩擦を強める [4]", "スタビ減速〇〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 24);
kaizouValue[11][1][1] = new Array("", "コーナー安定〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 3);
kaizouValue[11][2] = new Array();
kaizouValue[11][2][0] = new Array("スタビ摩擦を弱める [4]", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[11][2][1] = new Array("", "スタビ減速×× [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 24);

kaizouValue[12] = new Array();
kaizouValue[12][0] = new Array();

kaizouValue[13] = new Array();
kaizouValue[13][0] = new Array();
kaizouValue[13][0][0] = new Array("ターミナルチェック", "節電〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 10);
kaizouValue[13][0][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[13][1] = new Array();
kaizouValue[13][1][0] = new Array("ターミナル磨き [4]", "節電〇〇 [5] ", 0.05, 0.06, 0.07, 0.0025, -1, 10);
kaizouValue[13][1][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[13][2] = new Array();
kaizouValue[13][2][0] = new Array("ターミナル位置の固定 [2]", "パワーロス〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 7);
kaizouValue[13][2][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);

kaizouValue[14] = new Array();
kaizouValue[14][0] = new Array();
kaizouValue[14][0][0] = new Array("冷却能力向上", "節電〇 [3] ", 0.03, 0.036, 0.042, 0.0015, -1, 10);
kaizouValue[14][0][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[14][1] = new Array();
kaizouValue[14][1][0] = new Array("軽量化", "重さ〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 5);
kaizouValue[14][1][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[14][2] = new Array();
kaizouValue[14][2][0] = new Array("剛性補強", "スタミナ耐久〇〇 [4] ", 0.04, 0.048, 0.056, 0.002, -1, 4);

kaizouValue[15] = new Array();
kaizouValue[15][0] = new Array();
kaizouValue[15][0][0] = new Array("ギヤメンテ", "ギヤ負荷〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 6);
kaizouValue[15][0][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[15][1] = new Array();
kaizouValue[15][1][0] = new Array("ギヤ慣らし", "パワーロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 7);
kaizouValue[15][1][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[15][2] = new Array();
kaizouValue[15][2][0] = new Array("ギヤ研磨 [4]", "ギヤ負荷〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 6);
kaizouValue[15][2][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);

kaizouValue[16] = new Array();
kaizouValue[16][0] = new Array();
kaizouValue[16][0][0] = new Array("プロペラシャフトメンテ", "ギヤ負荷〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 6);
kaizouValue[16][0][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[16][1] = new Array();
kaizouValue[16][1][0] = new Array("ギヤ慣らし", "パワーロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 7);
kaizouValue[16][1][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[16][2] = new Array();
kaizouValue[16][2][0] = new Array("ギヤ研磨 [4]", "ギヤ負荷〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 6);
kaizouValue[16][2][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);

kaizouValue[17] = new Array();
kaizouValue[17][0] = new Array();
kaizouValue[17][0][0] = new Array("ベアリングメンテ", "スピードロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 8);
kaizouValue[17][0][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[17][1] = new Array();
kaizouValue[17][1][0] = new Array("ベアリング慣らし [4]", "スピードロス〇〇 [3] ", -0.03, -0.036, -0.042, -0.0015, -1, 8);
kaizouValue[17][1][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[17][2] = new Array();
kaizouValue[17][2][0] = new Array("ベアリング抵抗減少 [2]", "スピードロス〇〇〇 [4] ", -0.04, -0.048, -0.056, -0.002, -1, 8);
kaizouValue[17][2][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);

kaizouValue[18] = new Array();
kaizouValue[18][0] = new Array();
kaizouValue[18][0][0] = new Array("回転ブレのチェック", "スピードロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 8);
kaizouValue[18][0][1] = new Array("", "スピード〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 1);
kaizouValue[18][1] = new Array();
kaizouValue[18][1][0] = new Array("シャフトチェック", "スピードロス〇 [2] ", -0.02, -0.024, -0.028, -0.001, -1, 8);
kaizouValue[18][1][1] = new Array("", "パワー〇 [1(固定)] ", 1.0, 1.2, 1.4, 0.0005, 100, 2);
kaizouValue[18][2] = new Array();
kaizouValue[18][2][0] = new Array("滑り止め加工 [4]", "スタミナ耐久〇 [2] ", 0.02, 0.024, 0.028, 0.001, -1, 4);

kaizouValue[19] = new Array();
kaizouValue[19][0] = new Array();

kaizouValue[20] = new Array();
kaizouValue[20][0] = new Array();

kaizouValue[21] = new Array();
kaizouValue[21][0] = new Array();

var calcFlg = 0;
var resultFlg = 0;
function All_Set() {
	calcFlg = 0;
	resultFlg = 0;
	for (var i = 0; i < nameValue.length; i++) {
		Type_Init(i);
		Type_Set(i, 1);
	}
	calcFlg = 1;
	for (var i = 0; i < nameValue.length; i++) {
		Type_Calc(i);
	}
	resultFlg = 1;
	Type_Calc(0);
}

function View_Set(value1) {
	var writeValue = "<table class='cstable'><tr><td>" + nameView[value1];
	writeValue += "<span id='id_" + nameValue[value1] + value1 + "'></span></td>";
	if (value1 == 2) {
		writeValue += "<td class='cstd'>　</td>"
		for (var i = 1; i <= 3; i++) {
			writeValue += "<td>" + "<input class='csinput' type='checkbox' id='" + nameValue[value1] + value1 + '_niku' + i + "'onchange='Type_Calc(" + value1 + ")'> 肉抜き" + i + "　</td>";
		}
	}
	writeValue += "</tr></table><table class='cstable'><tr><td class='cstd'>　</td>";
	for (var i = 0; i < typeSelect[nameCalc[value1]].length; i++) {
		if (i == 5 || i == 10 || i == 15) {
			writeValue += "</tr><tr><td class='cstd'>　</td>";
		}
		writeValue += "<td>" + typeView[typeSelect[nameCalc[value1]][i]] + "<input type='text' id='" + nameValue[value1] + "_" + typeValue[typeSelect[nameCalc[value1]][i]] + value1 + "' value=''><br>改造後 <input type='text' id='" + nameValue[value1] + "_" + typeValue[typeSelect[nameCalc[value1]][i]] + value1 + "_kai' value=''></td>";
	}
	writeValue += "</tr></table>";

	if (kaizouSelect[nameCalc[value1]][0].length != 0) {
		writeValue += "<table class='cstable'>";
		for (var i = 1; i <= 6; i++) {
			writeValue += "<tr><td class='cstd'>　</td><td>スロット" + i + " ";
			writeValue += "<span id='id_" + nameValue[value1] + value1 + "_slot" + i + "'></span><br>";
			writeValue += "<select id='" + nameValue[value1] + value1 + "_type" + i + "' onchange='Type_Calc(" + value1 + ")'>";
			writeValue += "<option value=2>イイ感じ</option><option value=3>職人技</option><option value=4 selected>至高の逸品</option></select>　強化Lv ";
			writeValue += "<select id='" + nameValue[value1] + value1 + "_lv" + i + "' onchange='Type_Calc(" + value1 + ")'>";
			for (var j = 1; j < 50; j++) {
				writeValue += "<option value=" + j + ">" + j + "</option>";
			}
			writeValue += "<option value=" + 50 + " selected>" + 50 + "</option></select></td>";
			for (var j = 1; j <= 3; j++) {
				writeValue += "<td><span id='id_" + nameValue[value1] + value1 + "_slot" + i + "_" + j + "'></span><br><input type='text' id='" + nameValue[value1] + value1 + "_slot" + i + "_" + j +"' value=''></td>";
			}
			writeValue += "</tr>";
		}
		writeValue += "</table>";
	}
	document.write(writeValue);
}

function Type_Init(value1) {
	var innerValue = "<select id='" + nameValue[value1] + value1 + "' onchange='Type_Set(" + value1 + ", " + nameUpdate[nameCalc[value1]] + ")'>";
	for (var i = 0; i < selectValue[nameCalc[value1]].length; i++) {
		innerValue += "<option value=" + i + ">" + selectValue[nameCalc[value1]][i][0] + "</option>";
	}
	document.getElementById("id_" + nameValue[value1] + value1).innerHTML = innerValue + "</select>";
}

function Type_Set(value1, value2) {
	var index = document.getElementById(nameValue[value1] + value1).value;
	if (kaizouSelect[nameCalc[value1]][0].length != 0) {
		if (value2 == 1) {
			var innerValue = "";
			for (var i = 1; i <= 6; i++) {
				innerValue = "<select id='" + nameValue[value1] + value1 + "_slot" + i + "' onchange='Type_Slot_Set(" + value1 + ", " +  (i - 1) + ")'>";
				innerValue += "<option value=-1 selected>改造選択</option>";
				for (var j = 0; j < kaizouSelect[nameCalc[value1]][index].length; j++) {
					innerValue += "<option value=" + kaizouSelect[nameCalc[value1]][index][j] + ">" + kaizouValue[nameCalc[value1]][kaizouSelect[nameCalc[value1]][index][j]][0][0] + "</option>";
				}
				document.getElementById("id_" + nameValue[value1] + value1 + "_slot" + i).innerHTML = innerValue + "</select>";
				for (var j = 0; j < 3; j++) {
					document.getElementById("id_" + nameValue[value1] + value1 + "_slot" + i + "_" + (j + 1)).innerHTML = "";
				}
			}
		}
	}
	for (var i = 0; i < typeSelect[nameCalc[value1]].length; i++) {
		document.getElementById(nameValue[value1] + '_' + typeValue[typeSelect[nameCalc[value1]][i]] + value1).value = selectValue[nameCalc[value1]][index][typeSelect[nameCalc[value1]][i]];
	}
	Type_Calc(value1);
}

function Type_Slot_Set(value1, value2) {
	var index = document.getElementById(nameValue[value1] + value1 + '_slot' + (value2 + 1)).value;
	for (var j = 0; j < 3; j++) {
		document.getElementById("id_" + nameValue[value1] + value1 + "_slot" + (value2 + 1) + "_" + (j + 1)).innerHTML = "";
	}
	if (index != -1) {
		for (var j = 0; j < kaizouValue[nameCalc[value1]][index].length; j++) {
			document.getElementById("id_" + nameValue[value1] + value1 + "_slot" + (value2 + 1) + "_" + (j + 1)).innerHTML = kaizouValue[nameCalc[value1]][index][j][1];
		}
	}
	Type_Calc(value1);
}

function Type_Calc(value1) {
	if (calcFlg == 0) return 0;
	if (kaizouSelect[nameCalc[value1]][0].length == 0) {
		var nameIndex = document.getElementById(nameValue[value1] + value1).value;
		var calcValue = new Array(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0); //24
		for (var i = 1; i < selectValue[nameCalc[value1]][nameIndex].length; i++) {
			calcValue[i] = selectValue[nameCalc[value1]][nameIndex][i];
		}
		for (var i = 0; i < typeSelect[nameCalc[value1]].length; i++) {
			document.getElementById(nameValue[value1] + "_" + typeValue[typeSelect[nameCalc[value1]][i]] + value1 + "_kai").value = calcValue[typeSelect[nameCalc[value1]][i]];
		}
	} else {
		for (var i = 1; i <= 6; i++) {
			for (var j = 1; j <= 3; j++) {
				document.getElementById(nameValue[value1] + value1 + "_slot" + i + "_" + j).value = "";
			}
		}
		var nameIndex = document.getElementById(nameValue[value1] + value1).value;
		var calcValue = new Array(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0); //24
		for (var i = 1; i < selectValue[nameCalc[value1]][nameIndex].length; i++) {
			calcValue[i] = selectValue[nameCalc[value1]][nameIndex][i];
		}
		if (value1 == 2) {
			for (var i = 1; i <= 3; i++) {
				if (document.getElementById(nameValue[value1] + value1 + '_niku' + i).checked) {
					calcValue[5] -= 0.32;
				}
			}
		}
		for (var i = 1; i <= 6; i++) {
			var slotIndex = document.getElementById(nameValue[value1] + value1 + '_slot' + i).value;
			if (slotIndex == -1) continue;
			var typeVal = document.getElementById(nameValue[value1] + value1 + '_type' + i).value;
			var lvVal = document.getElementById(nameValue[value1] + value1 + '_lv' + i).value;
			for (var j = 0; j < kaizouValue[nameCalc[value1]][slotIndex].length; j++) {
				var typeIndex = kaizouValue[nameCalc[value1]][slotIndex][j][7];
				var kaizouVal = 0.0;
				if (kaizouValue[nameCalc[value1]][slotIndex][j][6] == -1) {
					kaizouVal = selectValue[nameCalc[value1]][nameIndex][typeIndex] * kaizouValue[nameCalc[value1]][slotIndex][j][typeVal];
				} else {
					kaizouVal = kaizouValue[nameCalc[value1]][slotIndex][j][typeVal];
				}
				var kyoukaVal = (calcValue[typeIndex] + kaizouVal) * kaizouValue[nameCalc[value1]][slotIndex][j][5] * lvVal;
				document.getElementById(nameValue[value1] + value1 + "_slot" + i + "_" + (j + 1)).value = kaizouVal + kyoukaVal;
				calcValue[typeIndex] += kaizouVal + kyoukaVal;
				if (calcValue[typeIndex] < 0) calcValue[typeIndex] = 0;
			}
		}
		for (var i = 0; i < typeSelect[nameCalc[value1]].length; i++) {
			document.getElementById(nameValue[value1] + "_" + typeValue[typeSelect[nameCalc[value1]][i]] + value1 + "_kai").value = calcValue[typeSelect[nameCalc[value1]][i]];
		}
	}
	if (resultFlg == 0) return 0;
	Result_Calc();
}

function Result_Calc() {
	var resultValue = new Array(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0); //24
	var resultValueKai = new Array(0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0); //24
	var disp1 = window.parent.results.document.getElementById('disp1').checked;
	for (var value0 = 0; value0 < nameValue.length; value0++) {
		var disp1Flg = 0;
		if (disp1) {
			if (value0 >= 27 && value0 <= 31) {
				if (window.parent.mains.document.getElementById(nameValue[value0] + value0).value == 0) disp1Flg = 1;
			}
		}
		for (var i = 0; i < typeSelect[nameCalc[value0]].length; i++) {
			if (disp1Flg == 1 && typeSelect[nameCalc[value0]][i] != 5) continue;
			resultValue[typeSelect[nameCalc[value0]][i]] += 1 * window.parent.mains.document.getElementById(nameValue[value0] + "_" + typeValue[typeSelect[nameCalc[value0]][i]] + value0).value;
			resultValueKai[typeSelect[nameCalc[value0]][i]] += 1 * window.parent.mains.document.getElementById(nameValue[value0] + "_" + typeValue[typeSelect[nameCalc[value0]][i]] + value0 + "_kai").value;
		}
	}
	for (var i = 1; i < typeValue.length; i++) {
		window.parent.results.document.getElementById(typeValue[i]).value = resultValue[i];
		window.parent.results.document.getElementById(typeValue[i]+ "_kai").value = resultValueKai[i];
	}
}

function View_Result() {
	document.write("<table class='cstable'><tr>");
	document.write("<td><input class='csinput' type='radio' id='disp1' name='disp' onchange='Result_Calc()'>標準表示　");
	document.write("<input class='csinput' type='radio' id='disp2' name='disp' onchange='Result_Calc()' checked>超速GPエントリー変更前表示　</td>");
	document.write("</tr></table><table class='cstable'><tr><td class='cstd'>　</td>");
	for (var i = 1; i < typeValue.length; i++) {
		if (i == 6 || i == 11 || i == 16 || i == 21) {
			document.write("</tr>");
			document.write("<tr><td class='cstd'>　</td>");
		}
		document.write("<td>" + typeView[i] + "<input type='text' id='" + typeValue[i] + "' value=''><br>改造後 <input type='text' id='" + typeValue[i] + "_kai' value=''></td>");
	}
	document.write("</tr></table>");
}

